[
  {
    "restaurant_name": "Connolly's",
    "city": "New York City",
    "place_id": "ChIJAS6GeVVYwokRPfg8xt4nH-I",
    "review_text": "Our favourite bar during our entire stay. We visited every day after our first visit was so great, and it became our local! The food was delicious and the service impeccable. Special shout out to Darren the legend. He made us feel so welcome every visit, especially with how busy this bar is and he remembered us and our drinks order and even the football team my parter supported so the bar felt very homely. Would 10/10 recommend. Get yourselves to Connolly’s guys. Will be back next year",
    "review_rating": 5,
    "review_author": "Leah Lewis",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Connolly's",
    "city": "New York City",
    "place_id": "ChIJAS6GeVVYwokRPfg8xt4nH-I",
    "review_text": "This was an absolutely wonderful dining experience. The booth seating was awesome. A nice and quiet atmosphere. This is the best Fish & Chips I’ve had in NYC. I’ve tried several places but Connolly’s got it right. I did make a reservation but it’s not needed. I recommend Connolly’s highly and cannot wait to return.",
    "review_rating": 5,
    "review_author": "Frank Drake Jr",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Connolly's",
    "city": "New York City",
    "place_id": "ChIJAS6GeVVYwokRPfg8xt4nH-I",
    "review_text": "After finding a pizza place that we wanted to go to closed we decided to check out Connolly's. Upon entering we were told to go upstairs for quicker service, so we did and we're immediately seated. A server grabbed us waters and I eventually ordered a downeast cider from MA. The cider was super refreshing and had hints of sweetness without being too overpowering.\n\nWith my stomach not being too happy I ordered a baked potato and my mom the fish and chips substituting the fries for onion rings. Well the onion rings, to put it as nice as possible, had seen better days. They were way over cooked and  hard as bricks--we did not need to even bite into one to notice this! Thankfully the server understood and swapped out the rings for another piece of fish.\n\nAnd speaking of the fish it was amazing! Lightly fried and a little crispy around the edges it made every bite so good--no tartar sauce needed! Also, the meal came with coleslaw, which was nice surprise. It was cool and creamy and delicious as well. One of the servers recommended that next time we should get vinegar with the fish as it makes it even better.\n\nGreat service and good food.",
    "review_rating": 4,
    "review_author": "Chandra Jennings",
    "moods": [
      "quick_bite",
      "family"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Connolly's",
    "city": "New York City",
    "place_id": "ChIJAS6GeVVYwokRPfg8xt4nH-I",
    "review_text": "Make sure you have a reservation! We did and were able to get seated faster ... but 30 minutes later than the reservation time. It was a Saturday night in early December and therefore busy. The crowds from Rockefeller Center Spilled Out for blocks in all directions. So getting to the restaurant was a challenge. The food was just okay. It came out very fast, the staff was very attentive and friendly. They're all doing the best they can. A very busy restaurant this Saturday night. They have to say it again, make sure you have a reservation! Pictures is Lance stew and fish and chips. Also other entrees are bangers and mash, potato leek soup, and then pump food.",
    "review_rating": 4,
    "review_author": "Tom Gilmour",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Connolly's",
    "city": "New York City",
    "place_id": "ChIJAS6GeVVYwokRPfg8xt4nH-I",
    "review_text": "Is Irish pub and restaurant is a fine choice for dinner before or after your show just off Broadway. We had the bangers and mash and the lamb burger both of which were delicious. Their Guinness is poured right from a tap and their establishment is clean and well-staffed.",
    "review_rating": 5,
    "review_author": "Marc Tofsted",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "TAO Uptown",
    "city": "New York City",
    "place_id": "ChIJh3qVsvpYwokRVtJoHuKeQ3M",
    "review_text": "Came here for a birthday dinner, overall the service and food could be slightly better for our party of 7.  We had the seafood fried rice on a hotplate, sea bass with mango salad, and 2 pad thai noodles, sausage and shrimp fried rice and the snow pea veggie dish and orange covered chicken.  IMO, for the price of the seafood fried rice on the sizzling hot plate is totally not worth it. Also had the dessert sampler which looked amazing.  Pretty much we are there just for the atmosphere of the restaurant.  It isn’t anything authentic if that is your thing.  For 7 people outta the door plus tips is about $380.. which is somewhat reasonable.",
    "review_rating": 4,
    "review_author": "Ty L",
    "moods": [
      "celebration",
      "budget"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "TAO Uptown",
    "city": "New York City",
    "place_id": "ChIJh3qVsvpYwokRVtJoHuKeQ3M",
    "review_text": "Worth all of the hype— dishes, ambiance and service are all truly fantastic. Making a reservation is an absolute must. My date booked online for a late Saturday night and we were pretty much seated on time. The filet mignon with black garlic, shiitake butter and sun chokes was divine. The spicy tuna on crispy rice was extravagant. Many other tables enjoyed that as a shared plate as well. My date loved the traditional orange chicken and we shared an order of vegetable fried rice. Highly recommend for an evening of contemporary flair and upscale dining.",
    "review_rating": 5,
    "review_author": "Leonora A",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "TAO Uptown",
    "city": "New York City",
    "place_id": "ChIJh3qVsvpYwokRVtJoHuKeQ3M",
    "review_text": "TAO is a must visit experience in New York. The restaurant is stunning, with an impressive atmosphere that blends elegance and energy, making it perfect for a special dinner or a night out. We went as a group of three and tried several different dishes, all of them excellent full of flavor, beautifully presented, and perfect for sharing. The menu offers a great variety of highquality Asian inspired options, from sushi to hot dishes. The service was attentive and professional, and the vibrant ambiance makes the whole experience even more memorable. Definitely an iconic restaurant worth visiting.",
    "review_rating": 5,
    "review_author": "S Fernández",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "TAO Uptown",
    "city": "New York City",
    "place_id": "ChIJh3qVsvpYwokRVtJoHuKeQ3M",
    "review_text": "Old but still contemporary.\n\nSuch a value. Lunch special!\nWe had vegetable rolls, shrimp, wraps for appetizers and kungpao chicken, noodle, steak for main. Couldn't eat them all.\nGrand interior never gets old.\nServing very cordial as well.\nNext time, may come alone and eat at the bar.",
    "review_rating": 5,
    "review_author": "Sam Hahn",
    "moods": [
      "budget",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "TAO Uptown",
    "city": "New York City",
    "place_id": "ChIJh3qVsvpYwokRVtJoHuKeQ3M",
    "review_text": "Went to Tao uptown last night to celebrate a belated birthday and service, food and atmosphere were all 10 out of 10. Our server Paolo was the absolute best! Will absolutely ask for him next time we make a reservation. He made our dining experience even more fun, plus he took care of some of my friend’s dietary restrictions with ease. Drinks, apps, mains, and desserts all incredible. The orange chicken, fried rice, rock shrimp, and fortune cookie dessert were some of the favs.",
    "review_rating": 5,
    "review_author": "Diane M",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Carmine's - Time Square",
    "city": "New York City",
    "place_id": "ChIJR9So-lRYwokRX1xEjA0rChA",
    "review_text": "Review – Carmine’s (Times Square, NYC)\n\nCarmine’s is a classic Italian restaurant right in the heart of Times Square, and it’s absolutely a must-go if you’re in the area. The place has that old-school Italian charm —bustling, lively, and full of energy— perfect for groups or family-style dining.\n\nThe portions are enormous. Seriously, one dish can easily serve three to five people. We were two and ordered a lasagna, which could have fed four hungry diners without a problem. The flavors were rich and comforting, exactly what you’d expect from a great Italian spot.\n\nThe service is outstanding —friendly, efficient, and perfectly coordinated, even though the restaurant is huge and always busy. I’d recommend making a reservation, but even if you don’t, the staff handles everything very smoothly.\n\nPrices are extremely reasonable, especially considering the portion sizes and location. We were so full we couldn’t even think about dessert —a rare thing!\n\n📍 Conclusion:\nCarmine’s is an NYC institution that delivers big flavor, big portions, and great service. Ideal for sharing and enjoying a true Italian-American dining experience.\n\n⭐ Overall rating: 9.5/10\n🍝 Best: massive portions and excellent service.\n🍰 Worst: impossible to save room for dessert.\n💸 Price: amazing value for Times Square.",
    "review_rating": 5,
    "review_author": "Francisco Simón Verger",
    "moods": [
      "family",
      "celebration",
      "budget"
    ],
    "mood_confidence": 0.85
  },
  {
    "restaurant_name": "Carmine's - Time Square",
    "city": "New York City",
    "place_id": "ChIJR9So-lRYwokRX1xEjA0rChA",
    "review_text": "Carmine's in NYC is an absolute must for a birthday dinner! The atmosphere is buzzing and so much fun, perfect for celebrating. And the food? Huge portions of classic Italian comfort food that everyone will love. You definitely won't leave hungry, and it makes for a really memorable birthday experience.",
    "review_rating": 5,
    "review_author": "Keith Mills",
    "moods": [
      "celebration",
      "family"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Carmine's - Time Square",
    "city": "New York City",
    "place_id": "ChIJR9So-lRYwokRX1xEjA0rChA",
    "review_text": "Great food.  Huge portions.   Best if you are in a large group since each entree feed 3 people.  We loved the calamari and chicken parmigiana.  Very generous bread baskets.  The titanic ice cream dessert was delicious.  It’s a little loud so you have to speak loudly for conversation.",
    "review_rating": 5,
    "review_author": "gordon leung",
    "moods": [
      "celebration",
      "family"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Carmine's - Time Square",
    "city": "New York City",
    "place_id": "ChIJR9So-lRYwokRX1xEjA0rChA",
    "review_text": "Carmine’s Italian Restaurant was absolutely amazing! From start to finish, the experience was worth every minute. Our waitress, Kiara, was phenomenal. She was so kind, attentive, and genuinely made us feel taken care of the entire time. The food came out perfectly cooked and full of flavor, with very generous family-style portions. Seriously…huge servings. They even packed our to-go boxes neatly and thoughtfully which was such a nice touch. We didn’t have a reservation and waited about 45 minutes, but it was beyond worth it. The atmosphere, service and food all delivered. We’d gladly wait again. Highly recommend if you’re in NYC and want a memorable, comforting Italian meal.",
    "review_rating": 5,
    "review_author": "Katherine S",
    "moods": [
      "celebration",
      "family"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Carmine's - Time Square",
    "city": "New York City",
    "place_id": "ChIJR9So-lRYwokRX1xEjA0rChA",
    "review_text": "it's a big restaurant. They have wheelchair accessible entrance and seating, they have a elevator, they have a coat check in for coats & strollers. This restaurant is family-friendly you can come alone or for a date or even with your kids. The wait is crazy this restaurant is very busy and packed, even with a reservation you have to wait for a table. you have to do a reservation they never have tables available it be so packed. The waiters are nice and friendly they so be so busy but they make sure they pay attention to you and they make sure you good everytime. The drinks was wack taste like juice, the food was amazing it taste very good the steak is expensive but is worth it has great taste one of the best steaks I ever tasted with great flavor and seasoning. The dishes are huge so you can share with 3 people or even 4. I came for my nephew's birthday he loved it we got him the sundae which was amazing the whole table got some. This restaurant is a great Italian restaurant i would come back. the drinks need to be better.",
    "review_rating": 4,
    "review_author": "Kyara Melo",
    "moods": [
      "family",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Bryant Park Grill",
    "city": "New York City",
    "place_id": "ChIJqTF1eABZwokR3ZMQ2obIW4w",
    "review_text": "This was my first time dining at Bryant Park Grill, and it was absolutely amazing! From start to finish, the experience exceeded expectations.\n\nOur server Lena was a darling:  attentive, warm, and made sure everything was perfect. We started with the jumbo lump crab cake and salad, which was fresh and flavorful. My friend had the cashew-crusted salmon (he swapped the potatoes for asparagus,  great choice!), and I had the pan-roasted branzino, cooked to perfection. The blackberry nojito seltzer was a hit! We ended the evening with a chocolate brownie and vanilla ice cream that was the perfect sweet touch.\n\nDespite the buzz of the city around us, the atmosphere felt calm and intimate.   A little oasis right in the heart of it all. I guess when you have an amazing date and great food, nothing else really matters 😊\n\nHighly recommend and can’t wait to return!",
    "review_rating": 5,
    "review_author": "Allia Sween",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Bryant Park Grill",
    "city": "New York City",
    "place_id": "ChIJqTF1eABZwokR3ZMQ2obIW4w",
    "review_text": "We were very let down. Marked that we were celebrating a special occasion which was acknowledged by no one. Both hosts/managers hosting felt irritated and offered zero warmth or connection upon entering and being seated. Soon as we hit the table multiple parties near us were asking where there servers were, even getting up and going to the host stand to ask why a waiter hasn't come for their order. We experienced the same delay and decided to just order drinks given the obvious concerns from other patrons about the lack of attentiveness and concern for their business or their family's meals. Our waiter while doing his job, was just like the host stand, no real connection, no small talk, no how are you, thanks for coming. Just to the point and not attached to the vibes of his customers or engaging in any meaningful way. This is the last thing I expect from an icon that makes their money from hosting special occasions and charges what they do for dishes and cocktails. I'll pay the price for quality all day, but the service was truly horrible on Sat January 3rd when we visited around 7:00pm to the point we felt ripped off. The atmosphere was classy, warm, inviting... But the people running the business that evening couldn't match that expectation, and their impact brought the entire evening down. Dozens of experiences in NYC where restaurants are hyped up and deliver, not here. BP Grill should reevaluate who staffs a critical holiday weekends and I hope others don't walk away feeling so disappointed like we did.",
    "review_rating": 3,
    "review_author": "Russ Dean",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Bryant Park Grill",
    "city": "New York City",
    "place_id": "ChIJqTF1eABZwokR3ZMQ2obIW4w",
    "review_text": "Got seated within a couple of minutes despite all the dinner peak hour rush in a holiday season. Customer service was excellent - took care of orders and food delivery in a timely manner. Food was amazing - well cooked and perfect taste. Drink options were good. Not too noisy for conversations. Place appeared clean and well maintained.",
    "review_rating": 5,
    "review_author": "Vighnesh Balasubramanian",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Bryant Park Grill",
    "city": "New York City",
    "place_id": "ChIJqTF1eABZwokR3ZMQ2obIW4w",
    "review_text": "For opening day of the Winter Village I was at Bryant Park. Although I walked to see the decor of another restaurant not liking the way I was treated,went back to Bryant Park Grill,which was not crowded at all. I was seated with courtesy and a smile. The lunch was excellent as was my cucumber refresher movktail. The Foccia bread was sublime. Served on a light layer of olive oil,with fresh butter topped with a sprig of rosemary. I was so happy to have walked back to the park for this.\nExcellent,excellent service,servers and food",
    "review_rating": 5,
    "review_author": "Dorothy Gordon",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Bryant Park Grill",
    "city": "New York City",
    "place_id": "ChIJqTF1eABZwokR3ZMQ2obIW4w",
    "review_text": "Came here with a party of 9 after our original reservation somewhere else fell through and got seated right away! And this was during xmas week! They have a big outdoor (tented/heated) and cute seating area so there is a lot of seating, even during peak hours. I ordered the branzino and it was absolutely delicious! Someone else in my party ordered the salmon and loved it as well. Even though the menu items are on the pricier side, I would say it’s worth it since the food is great and this restaurant is in such a prime location!",
    "review_rating": 5,
    "review_author": "Zoey Ma",
    "moods": [
      "celebration",
      "budget"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Grand Central Oyster Bar",
    "city": "New York City",
    "place_id": "ChIJR9legAFZwokRa1s5gcFXPZw",
    "review_text": "For a few years in the late 1970s, I worked literally three blocks from Grand Central Station. And I’ve spent many more years since then working in and visiting New York City. Yet somehow—almost inexplicably—I had never set foot in the Grand Central Oyster Bar.\n\nThankfully, that oversight was corrected in mid-December, when I found myself in the neighborhood looking for lunch and finally answered the call of this legendary spot.\n\nWalking down into the Oyster Bar feels like stepping into another era of New York: the iconic tiled, vaulted ceilings, the gentle hum of conversation, and the sense that very little here has changed—and that’s exactly the point.\n\nI took a seat at the long counter, which turned out to be the perfect vantage point. From there, I could watch the shuckers work with practiced ease and see a cook steadily turning out stews, \"roasts\", and chowders, all with the quiet efficiency that comes from doing something well for over a century.\n\nThere’s a reassuring confidence to the place, the kind that only comes from decades of consistency.\n\nLunch itself was excellent. I started with six Long Island Cherrystone clams and a half-dozen Malpeque oysters from Prince Edward Island—fresh, briny, and impeccably handled.\n\nTo finish, I ordered a bowl of red Manhattan clam chowder, my longtime favorite style, and one that many consider among the best anywhere. It was deeply flavorful, balanced, and exactly what I hoped it would be.\n\nThe Grand Central Oyster Bar isn’t about trends or reinvention. It’s about tradition, quality seafood, and a singular sense of place—something increasingly rare. I’m genuinely glad I finally made it, and I won’t be waiting decades before my next visit. Highly recommended that you stop in sometime yourself.",
    "review_rating": 4,
    "review_author": "Charlie Byrne",
    "moods": [
      "work",
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Grand Central Oyster Bar",
    "city": "New York City",
    "place_id": "ChIJR9legAFZwokRa1s5gcFXPZw",
    "review_text": "Such a simple guilty pleasure... raw oysters, a pan roast and a berr for lunch. Oysters are always fresh and many to chose from. I like to get 2 each of 6 different ones. The server's favorite turned put to be mine as well. Clam pan roast is so good, filling and soaked up into the oyster crackers nicely. I sit at the counter close to the oyster shockers and the stew/pan roast prep. It's all fun to watch.",
    "review_rating": 5,
    "review_author": "Kurt Wallach",
    "moods": [
      "quick_bite"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Grand Central Oyster Bar",
    "city": "New York City",
    "place_id": "ChIJR9legAFZwokRa1s5gcFXPZw",
    "review_text": "Really cool restaurant in Grand Central Station.  Visiting NY and wanted done oysters and seafood.  Oysters weren't bad, but the greatest.  We had a wide selection hoping for some Britney plump Oysters, but they were average at best.  Clam chowder wasn't bad.  Have had seafood at plenty of restaurants along the coast. This place was average and more a novelty with being in Grand Central Station.  We sat on restaurant seated site, then have a more laid back open dining area, and then a bar lounge area. Liked the setup, wish food was much better, really wanted to love it. But liked it at best.",
    "review_rating": 4,
    "review_author": "RJ A",
    "moods": [
      "work",
      "quick_bite"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Grand Central Oyster Bar",
    "city": "New York City",
    "place_id": "ChIJR9legAFZwokRa1s5gcFXPZw",
    "review_text": "I have very wife spectrum of experience at this place. Sometimes really fantastic. Good vibe at Saloon bar. Martinis and oysters... sometimes not so... especially pickpocket roaming around and management not responsive.\n\nThis time at oyster bar side. Fantastic one. Oysters were good. Clams and chowder too. Martinis crisp with extra on the side. Service attentive.\n\nArchitectural marvel. Historic vibe wonderful. Let's keep up the consistency!",
    "review_rating": 5,
    "review_author": "Sam Hahn",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Blue Fin",
    "city": "New York City",
    "place_id": "ChIJzz-PyFVYwokRwp5z0KduYls",
    "review_text": "The service was excellent. Brendan was quick, friendly, and professional.\nThe sea bass was very good. The scallops and pork belly had as a a side what I am told is the best corn my dining companion has had in his life. The scallops were not flavorful but the pork belly was recommended.\nGreat oysters.\nI recommend the tiger shrimp dumplings.\nThe lobster bisque had chunks of lobster, and was well flavored.",
    "review_rating": 5,
    "review_author": "L Jean Camp",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Blue Fin",
    "city": "New York City",
    "place_id": "ChIJzz-PyFVYwokRwp5z0KduYls",
    "review_text": "Gluten Free/Celiac was a breeze here. Gabby, our server, was absolutely lovely and took great care of us. She assured me that my food was safe and she even double checked. Food was amazing. Atmosphere was so relaxing and enjoyable.\nIf you are in Times Square……you gotta eat here!",
    "review_rating": 5,
    "review_author": "Jennifer Kucharik",
    "moods": [
      "work",
      "date",
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Blue Fin",
    "city": "New York City",
    "place_id": "ChIJzz-PyFVYwokRwp5z0KduYls",
    "review_text": "My husband and I love going here for date night. The happy hour menu is incredible and slept on. The buffalo cauliflower is a must and their sushi is incredible! You must try their blueberry margarita!!",
    "review_rating": 5,
    "review_author": "Joi Brown- Lindsay",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Blue Fin",
    "city": "New York City",
    "place_id": "ChIJzz-PyFVYwokRwp5z0KduYls",
    "review_text": "Absolutely delicious. The decor and the atmosphere was so stunning, the hostess, servers everyone was absolutely wonderful. Came here on a Sunday around 5pm after seeing a play at the Marquis theater not crowded? Food came out quickly? Prices were more than fair. True hidden GEM! Definitely stop by if you’re in this area seeing one of the Broadway plays.",
    "review_rating": 5,
    "review_author": "Audrey S (Dezden)",
    "moods": [
      "celebration",
      "budget"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Blue Fin",
    "city": "New York City",
    "place_id": "ChIJzz-PyFVYwokRwp5z0KduYls",
    "review_text": "Came here on a Thursday evening. The atmosphere was calming and nice. The Miso glazed Sea Bass & Pan seared Salmon was fresh & delicious. Our server, Al, was great to work with & helpful in choosing our entrees. Look forward to visiting again!",
    "review_rating": 5,
    "review_author": "Ariana Flores",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Shake Shack Theater District",
    "city": "New York City",
    "place_id": "ChIJhXAgf1NYwokRBzdqc2TRX_I",
    "review_text": "Had an amazing experience at Shake Shack! The male server who delivered our burgers was incredibly energetic and full of smiles. He served our food swiftly and diligently, explaining everything clearly, all while keeping a positive, lively vibe throughout the restaurant.\n\nHe really set the tone for the whole place, making it feel welcoming and well managed, and the cleanliness of the tables and surroundings was noticeable too. Truly a standout example of excellent service, definitely deserves praise!",
    "review_rating": 5,
    "review_author": "DC",
    "moods": [
      "quick_bite",
      "family"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Shake Shack Theater District",
    "city": "New York City",
    "place_id": "ChIJhXAgf1NYwokRBzdqc2TRX_I",
    "review_text": "🍔 Quick, tasty, and full of little surprises!\n\nWe stopped by Shake Shack in the Theater District for a casual dinner — and it turned out to be a really great choice. The service was fast, and what’s nice is that they actually bring the food right to your table, which makes the experience more relaxed and enjoyable. 🙌\n\nI ordered one of their classic burgers and was surprised by a fun little twist — crispy fried pickles in batter! 🥒✨ It was something different and added a nice crunch to the meal. Everything was hot, fresh, and full of flavor.\n\nThere’s plenty of seating, which is a big plus in this area, and it didn’t feel cramped or noisy even during the dinner rush. Tables were clean, and the vibe was welcoming.\n\n✅ Great for a quick bite before or after a Broadway show\n✅ Fun menu twists (fried pickles, yes please!)\n✅ Enough space to sit down and enjoy your meal\n\nIf you’re in Midtown and need a fast, delicious, and hassle-free dinner — I definitely recommend this location of Shake Shack! 🍟🍔",
    "review_rating": 4,
    "review_author": "Maryna Stupak",
    "moods": [
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Shake Shack Theater District",
    "city": "New York City",
    "place_id": "ChIJhXAgf1NYwokRBzdqc2TRX_I",
    "review_text": "Delicious burgers and milkshakes. Friendly service. Reasonable prices. Gets very crowded and hard to find a table to sit at.  Does have some counters to stand up and eat also. Has a restroom for customers. Free cups of water.",
    "review_rating": 4,
    "review_author": "Michele Grove",
    "moods": [
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Shake Shack Theater District",
    "city": "New York City",
    "place_id": "ChIJhXAgf1NYwokRBzdqc2TRX_I",
    "review_text": "Love their burgers! I always get them well done. They are nice and juicy and the best with lettuce tomato and onions. My baby had  a mix of ice cream chocolate and vanilla with Oreo topping and he loved it. The staff was very accommodating attentive and friendly.",
    "review_rating": 5,
    "review_author": "Franny Bae",
    "moods": [
      "family",
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Shake Shack Theater District",
    "city": "New York City",
    "place_id": "ChIJhXAgf1NYwokRBzdqc2TRX_I",
    "review_text": "Stopped by Shake Shack Theatre Street, NYC for a late-night bite, and even at 10 PM, the place was packed—a testament to its popularity, but also a reminder that you might need to wait for a table. Ambience was nothing special, just your typical fast-casual setup, but the food made up for it.\nTried the Truffle Burger, and it delivered-tender, juicy patties with deep, rich flavors that didn't disappoint. The milkshake? A standout! Fragrant, creamy, and indulgent without feeling too heavy. Bonus points for table delivery, which made the experience smoother.\n\nIf you don't mind the crowd, it's a solid spot for a satisfying, late-night burger fix. Would I return? Yes, if I am looking for a quick meal.",
    "review_rating": 4,
    "review_author": "Merryheart",
    "moods": [
      "late_night",
      "quick_bite"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Shake Shack Madison Square Park",
    "city": "New York City",
    "place_id": "ChIJz1idlLxYwokRwl1Twi2KrIQ",
    "review_text": "This modern spot feels like an urban oasis, blending seamlessly into a spacious park setting. There are plenty of open-air tables, giving the place a relaxed and airy vibe. At night, string lights glow in the trees, creating a magical and surprisingly romantic atmosphere right in the middle of New York’s hustle and bustle.\n\nShake Shack has locations all over the world, but enjoying it at the original location—surrounded by skyscrapers and fresh park air—feels truly special. It’s the perfect blend of where it all began and where it’s at its best. A must-visit when you’re in New York.",
    "review_rating": 4,
    "review_author": "Takahiro Koyama",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Shake Shack Madison Square Park",
    "city": "New York City",
    "place_id": "ChIJz1idlLxYwokRwl1Twi2KrIQ",
    "review_text": "Ah, the birthplace of the ShackBurger. A shrine to hype. A temple of queues. And yet, somehow, a graveyard for flavor.\n\nLet’s start with the kitchen: twelve people in branded t-shirts, bustling like extras in a food-themed sitcom. Only two appeared to be working. The rest? Pacing, chatting, possibly auditioning for a reboot of Waiting for Godot. Meanwhile, your burger dreams die slowly in the fryer fumes.\n\nThe food? A soggy, lukewarm betrayal. Fries that taste like they were prepped during the Bush administration. Buns with the texture of damp cardboard. Cheese that whispers “I used to be milk but now I’m just plastic” before vanishing into the ether.\n\nAnd the seating, oh, the seating. A gladiatorial contest of elbows and passive-aggressive hovering. If you do snag a spot, you’re rewarded with the only redeeming feature: summer people-watching. Tourists marveling at squirrels, locals pretending this is still cool, and pigeons plotting unionization.\n\nCome winter, the charm freezes over. You’re left with overpriced sadness and the haunting suspicion that Danny Meyer weeps softly into a crinkle-cut fry every time someone calls this “iconic.”\n\nSave your money. Save your dignity. Go to literally any bodega and get a sandwich made by someone who cares.",
    "review_rating": 1,
    "review_author": "maciek macak",
    "moods": [
      "budget"
    ],
    "mood_confidence": 0.6
  },
  {
    "restaurant_name": "Shake Shack Madison Square Park",
    "city": "New York City",
    "place_id": "ChIJz1idlLxYwokRwl1Twi2KrIQ",
    "review_text": "It was a long lineup , which made me to think it should be a good place to try the food. I almost waited for 15-20 mins for order and get the Veggie burger. I loved the vibe which is a nice park and has bench to seat. I would say it was ok, but worth to stop and try because of the vibe.",
    "review_rating": 5,
    "review_author": "Tannaz Nouri",
    "moods": [
      "quick_bite"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Shake Shack Madison Square Park",
    "city": "New York City",
    "place_id": "ChIJz1idlLxYwokRwl1Twi2KrIQ",
    "review_text": "The hot dogs were very good.  The service fast and friendly. The vibe in the park was perfect with a busking Jazz trio adding to the atmosphere. My only wish that smokers (all weeds) were not allowed near tables where people are eating.",
    "review_rating": 5,
    "review_author": "Dave Marshall",
    "moods": [
      "quick_bite",
      "family"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Shake Shack Madison Square Park",
    "city": "New York City",
    "place_id": "ChIJz1idlLxYwokRwl1Twi2KrIQ",
    "review_text": "Beautiful place to stop for a bite to eat and see the flagship Shake Shack, the original! Fun to see where it all started. It's not cheap (This meal cost $66.99) and the wait is long when it's busy but it's delicious!!",
    "review_rating": 5,
    "review_author": "Marieanne Porter",
    "moods": [
      "quick_bite",
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Ellen's Stardust Diner",
    "city": "New York City",
    "place_id": "ChIJ_85dJlZYwokR29NPLSJngR4",
    "review_text": "A unique dining experience must try. We came here for our daughter’s birthday. You have to wait in line as no reservations so be prepared to stand in line, we waited about 1.5 hrs to get table.  You walk into servers serving food and singing songs from broadway plays as well as other songs. It is a lively fun experience while you enjoy your meal. The food was good with vegetarian options. We especially loved the nachos. The drinks were good as well nothing exceptional but still good. Our daughter enjoyed hearing all the Broadway songs and the servers did a fanatic job.",
    "review_rating": 5,
    "review_author": "Mohsin Syed",
    "moods": [
      "celebration",
      "family"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Ellen's Stardust Diner",
    "city": "New York City",
    "place_id": "ChIJ_85dJlZYwokR29NPLSJngR4",
    "review_text": "Great experience. I recommend visiting around midday as that’s their quieter times and we didn’t queue at all.\n\nThe singing is fantastic and obviously what you go there for however the food was OK, not much flavour.\n\nI saw reviews about the tip box being constant but we only had it once and you wasn’t pressured.\n\nFor 2x burgers, fries and 2 soft drinks was $86 including a 20% tip that was automatically added to the bill so it was clear on our visit by the staff you didn’t have to cash tip.",
    "review_rating": 4,
    "review_author": "Molly Champion-Pinchin",
    "moods": [
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Ellen's Stardust Diner",
    "city": "New York City",
    "place_id": "ChIJ_85dJlZYwokR29NPLSJngR4",
    "review_text": "MLK Weekend 2026: My daughter & I visited for our 1st NYC trip & her 18th Birthday! What a fabulous experience! Great entertainment, service, & food! The line to wait was LONG, but the time it took to get seated was relatively QUICK! Probably 30 people deep in line, sat within 15 minutes! Hope to go back & take friends & family!",
    "review_rating": 5,
    "review_author": "Amanda Sullivan",
    "moods": [
      "celebration",
      "family"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Ellen's Stardust Diner",
    "city": "New York City",
    "place_id": "ChIJ_85dJlZYwokR29NPLSJngR4",
    "review_text": "We’ve been to Ellen’s Stardust Diner twice — the most recent visit was in the summer when we brought friends. Just like always, no matter what time you arrive, there’s a long line outside. It has become part of the experience at this point.\n\nThe biggest highlight of this diner is definitely the singing waitstaff. They don’t just serve your food and take your order — they perform amazing Broadway-style songs right in front of you. It’s such a fun and unique atmosphere! Many of them are hoping to make it onto Broadway someday, so this place feels like a stepping stone for real talent.\n\nNow… the food. Let’s just say you’re not here for a Michelin-star meal. It’s very average diner food, maybe even a bit below that. Nothing terrible, but definitely not why you come here. You’re paying for the show, the energy, the nostalgia, and the one-of-a-kind entertainment.\n\nSo if you’re visiting New York with friends or family and want something memorable (and loud), this is the place. Come for the singing — not the menu.",
    "review_rating": 4,
    "review_author": "J J",
    "moods": [
      "celebration",
      "family"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Ellen's Stardust Diner",
    "city": "New York City",
    "place_id": "ChIJ_85dJlZYwokR29NPLSJngR4",
    "review_text": "What a fun place to have a meal! The long line to get inside is definitely justified -- and don't be daunted because the waiting isn't as long as it may look. Inside you enter a buzz of activity and entertainment. Non-stop singing by a talented wait staff makes for a memorable meal. And the food is pretty darn good. We enjoyed burgers and sandwiches for lunch and the portions were large and tasty  Overall, an incredibly fun experience and a can't miss if you are visiting NYC.",
    "review_rating": 5,
    "review_author": "David Liebler",
    "moods": [
      "celebration",
      "family"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Del Frisco's Double Eagle Steakhouse",
    "city": "New York City",
    "place_id": "ChIJE1bnSP9YwokRDK7Zxnt23gE",
    "review_text": "We frequent here for all major celebrations because the steak is unbeatable and the atmosphere is nice.\n\nHighly recommend:\nPorterhouse\nRibeye\nTuna tartare\nMashed potatoes\nFried Calamari (off menu app)\n\nShoutout to Sanem the best waitress we have had while at Del Frisco. I’m mainly writing this review to mention her exemplary service.",
    "review_rating": 5,
    "review_author": "Susan N.",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Del Frisco's Double Eagle Steakhouse",
    "city": "New York City",
    "place_id": "ChIJE1bnSP9YwokRDK7Zxnt23gE",
    "review_text": "We had just made it to town, were hungry, and didn't want to shop around for food. My wife and I dined here the last time we were in town and loved our meal. So, dining hear again was a no brainer.. Del Frisco's it is.\n\nOur second time didn't disappoint either We ordered steaks, cocktails, appetizers and wine.\n\nFor the cocktails, she had the Passion Fruit Margarita, and I had the Whistle Pig Barrel Aged Manhattan. The cocktails were on point. Additionally, we both had a glass of Cabernet Sauvignon with our meal.\n\nFor the appetizer we went with the Thick-Cut Nueske’s Bacon and the Charred Octopus. The Bacon was excellent, smokey and delicious. The Octopus was disappointing.  It was overcooked and chewy, so we had to send that one back.\n\nFor our main courses, my wife ordered the Braised Angus Short Rib and was  later informed  that it was sold out, so she settled for the Filet Mignon, and I had the Bone-In Prime Ribeye.  For our sides we had fries, broccolini and the Classic Caesar. Oh, and not to mention, that wonderful warm bread for the table. All of the meats were cooked to perfection, the sides were great, but on a side note... the side of fries was way more then we expected. I would say was enough for 5 people.\n\nThe steak house itself has a nice sexy ambiance, but still chill enough for the fellas to grab a meal or hang at the bar.\n\nThe service was great, our waiter M.D. was very professional and attentive. He was very apologetic for the mess up on the Short Rib order and the over cooked Octopus. Even the Supervisor,  (Kristin), came over and checked on us to make sure we were good and chatted with us about the New York food scene.\n\nThank you both for a good time.",
    "review_rating": 4,
    "review_author": "James Johnson",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.85
  },
  {
    "restaurant_name": "Del Frisco's Double Eagle Steakhouse",
    "city": "New York City",
    "place_id": "ChIJE1bnSP9YwokRDK7Zxnt23gE",
    "review_text": "This is genuinely one of my favorite steakhouses in the world. Its one of those rare place where no matter what you choose on the menu you do so with confidence that it will be delicious. It is pricey of course but the flavor more than delivers, the quality is top notch and the portion sizes are truly *american*. It is also very lively inside (for dinner) but quiet enough to have conversations. The tall ceilings and large windows create a spacious atmosphere.",
    "review_rating": 5,
    "review_author": "deniz yarsuvat",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Del Frisco's Double Eagle Steakhouse",
    "city": "New York City",
    "place_id": "ChIJE1bnSP9YwokRDK7Zxnt23gE",
    "review_text": "Five-Star Review for Del Frisco’s – Manhattan\n\nDel Frisco’s in Manhattan delivers an experience that reminds you why New York City is known for world-class dining. From the moment you step inside, the atmosphere feels elevated and full of energy. The staff greets you warmly and treats you like a valued guest throughout the entire meal. The service is smooth, attentive, and thoughtful without ever feeling rushed. Everyone working there seems to take real pride in what they do, which sets the tone for the rest of the evening.\n\nThe steaks truly deserve the reputation they have. Each cut is cooked exactly the way you ask, with a perfect sear on the outside and a tender, flavorful center. You can tell the kitchen uses high-quality ingredients and takes care in every step. The sides are just as impressive. The lobster macaroni and cheese, creamed spinach, and mashed potatoes are rich and satisfying. They complement the main dishes rather than overpowering them. Even the bread service is memorable, which says a lot about the overall attention to detail.\n\nThe seafood options are another highlight. The crab cakes are packed with lump crab meat and seasoned well. The shrimp cocktail is fresh and chilled correctly. Everything arrives beautifully presented, and the flavors match the presentation. For drinks, the wine list is extensive and curated with care. The staff is knowledgeable and ready to help you pair the right bottle or cocktail with your meal.\n\nDessert is worth saving room for. The butter cake is one of the best ways to end a dinner, warm and soft with a balance of sweetness that makes you want to order another. Whether you are celebrating a special occasion or just want a great night out, Del Frisco’s knows how to make the evening feel important.\n\nOverall, Del Frisco’s in Manhattan stands out because it combines outstanding food, excellent service, and a welcoming atmosphere. Every part of the dining experience feels intentional. It is easy to see why so many people consider it a must-visit steakhouse in the city. If you want a meal that is consistently exceptional from start to finish, this is the place to go. This is a well-deserved five-star experience.",
    "review_rating": 5,
    "review_author": "Herman Dolce",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Del Frisco's Double Eagle Steakhouse",
    "city": "New York City",
    "place_id": "ChIJE1bnSP9YwokRDK7Zxnt23gE",
    "review_text": "This is my goto place when I have family and friends visiting from overseas. They haven’t disappointed me so far! The steak — cooked perfectly to your liking 😋The lobster Mac and cheese has good chunks of Lobster, creamy sauce and aldente pasta. We also had the octopus appetizer and it’s soooo good. Flavorful, right chewiness and good portion size. The other thing I look forward to is their honey bread and  the best part — it’s complementary. 😉",
    "review_rating": 5,
    "review_author": "Rosalie Reyes",
    "moods": [
      "celebration",
      "family"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Morton's The Steakhouse",
    "city": "New York City",
    "place_id": "ChIJR7SnMP5YwokR-8MZMiv4mJ0",
    "review_text": "This restaurant delivers an outstanding dining experience! The atmosphere is elegant yet comfortable, with a great mix of modern design and warmth. The menu offers a variety of premium steaks, seafood, and creative appetizers — everything beautifully presented and delicious. The quality and flavor are exceptional. Special thanks to Kai, the manager, who is absolutely fantastic — attentive, professional, and genuinely cares about every guest’s experience. Highly recommended!",
    "review_rating": 5,
    "review_author": "Aleh Ranchynski",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Morton's The Steakhouse",
    "city": "New York City",
    "place_id": "ChIJR7SnMP5YwokR-8MZMiv4mJ0",
    "review_text": "Dining at Morton’s The Steakhouse on Fifth Avenue was a real pleasure from start to finish. The atmosphere is elegant yet relaxed, with the perfect blend of classic New York steakhouse charm and professional service.\n\nThe porterhouse steak was cooked to perfection — juicy, flavorful, and beautifully seared. The French fries were crisp and seasoned just right, while the signature onion bread was warm and irresistible.\n\nFor starters, I tried the meatball with burrata and pesto, a surprising and delicious choice that felt both Italian and American in style. Everything was paired with a great selection of wines and cocktails; my dirty martini was perfectly balanced.\n\nOverall, Morton’s remains a benchmark for high-quality dining in New York City — excellent food, attentive staff, and a timeless atmosphere. Highly recommended for anyone looking for a true steakhouse experience.",
    "review_rating": 5,
    "review_author": "Tommaso GRIMALDI",
    "moods": [
      "work",
      "date",
      "celebration"
    ],
    "mood_confidence": 0.85
  },
  {
    "restaurant_name": "Morton's The Steakhouse",
    "city": "New York City",
    "place_id": "ChIJR7SnMP5YwokR-8MZMiv4mJ0",
    "review_text": "It has become a little tradition for me — every time I’m in the USA, I have to visit Morton’s for their amazing shrimp! The food never disappoints — perfectly cooked, flavorful, and always fresh. The steak and sides were also excellent, but the shrimp is always my personal favorite.\n\nThe service is top-notch, as always. The staff were attentive, friendly, and made me feel genuinely welcomed. The atmosphere is classic and elegant, yet still relaxed — perfect for both a nice dinner or a special occasion.\n\nMorton’s truly delivers consistent quality and an unforgettable dining experience every single time. Highly recommend it if you love great food, excellent service, and that timeless steakhouse charm.",
    "review_rating": 5,
    "review_author": "Wisuta Phuwiangkaeo",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Morton's The Steakhouse",
    "city": "New York City",
    "place_id": "ChIJR7SnMP5YwokR-8MZMiv4mJ0",
    "review_text": "Made a birthday reservation for two and got the full birthday princess treatment. Absolutely fabulous service, food, and atmosphere. Will definitely be returning and would absolutely recommend for any reason, but especially for special occasions",
    "review_rating": 5,
    "review_author": "Brielle",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Morton's The Steakhouse",
    "city": "New York City",
    "place_id": "ChIJR7SnMP5YwokR-8MZMiv4mJ0",
    "review_text": "What a wonderful elegant experience at Morton's steakhouse. My wife was given a Xmas gift to this establishment and from the time we entered and until we left it was all about us and the customer experience. My wife entered first and I was on my way , the staff was great and ensured her it would be a good time. When I arrived the staff again showed great appreciation for our time. The steak was great and we enjoyed the dessert and wine.",
    "review_rating": 5,
    "review_author": "Elliott Williams",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Keens Steakhouse",
    "city": "New York City",
    "place_id": "ChIJ5804KalZwokRzGll2Rm7nag",
    "review_text": "Let me start by saying that the atmosphere and vibe of the restaurant were amazing. You felt like you were stepping back in time. The waiter was amazing. The food, albeit flavorful, was not cooked properly and could've been much better. Here is a breakdown of what we got and my rating of each item...\n\nLobster Bisque: Amazing! The flavor was heavenly and I ate every last bit. Would recommend. Cost $16\n\nTaste of Mutton: Ordered medium rare and was served medium well. Because of this the meat was tough. There were 2 bites that were medium and they were much more tender but still not what we were expecting and had seen on videos. The flavor was amazing but I couldn't fully enjoy it. I was definitely disappointed as this was the reason we came here. Would not recommend unless you're comfortable sending your food back to be remade. Cost $35\n\nHash brown: This was more like a fried mashed potato pattie than hash browns. It was very delicious but I prefer the hashbrowns at Gallagher's Cost: $15\n\nPorterhouse: Ordered medium rare and it came out medium well. I was expecting better flavor, too. This was the biggest disappointment with the cost being $143\n\nThere are MANY other steakhouses that have much better food, in my opinion. I may have been spoiled by Gallagher's earlier in the week, however, for the same exact cost I was expecting something comparable. If you can only go to one, go to Gallagher's!",
    "review_rating": 3,
    "review_author": "Erin ModgePodge1111",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Keens Steakhouse",
    "city": "New York City",
    "place_id": "ChIJ5804KalZwokRzGll2Rm7nag",
    "review_text": "Warm, relaxing atmosphere. This is our 2nd time here, we made a very spontaneous trip to NYC (2 days before the flight lol) and did not get to sit infront of the tiger picture as we did last time in the Lamb’s Room, but we still had an exquisite experience!\n\nWe will definitely be back & will make sure to book reservations way ahead of time, to ensure we can sit where we’d like and eat dinner at an earlier time (8;30 was the only reservation slot open) we left with our bellies super full & happy! Service was great. Restaurant/ restrooms were clean & food was so delicious.",
    "review_rating": 5,
    "review_author": "Halona Beier",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.85
  },
  {
    "restaurant_name": "Keens Steakhouse",
    "city": "New York City",
    "place_id": "ChIJ5804KalZwokRzGll2Rm7nag",
    "review_text": "Keens. A must visit while in NYC. 🗽 A classic steakhouse that will give you a cut of steak 🥩 that is bigger than you!\nAn absolute jewel. Everywhere you look you see something vintage and unique.\nGiant flake salt on top of the steaks 👌👌 absolutely delicious. 🤤\nWe were here as guests with a company party 🎊 They sent around large cocktail shrimp and lamb lollipops as the appetizers 😋\nThey had a set menu for our group— I ordered the filet and green beans with dessert being chocolate mousse 👏",
    "review_rating": 5,
    "review_author": "Annabelle Veatch",
    "moods": [
      "celebration",
      "work"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Keens Steakhouse",
    "city": "New York City",
    "place_id": "ChIJ5804KalZwokRzGll2Rm7nag",
    "review_text": "Keen’s is such a classic New York steakhouse. The place is huge with tons of different rooms across multiple floors, so it feels historic but not stuffy. The decor is incredible, walls covered in old prints and memorabilia, you could honestly just wander around and look at everything. Staff were great all around, professional, friendly, and very on top of things.\n\nOnly real downside is the vibe at night could be better. There’s no music at all (and if there was it wasn't hearable) and the lighting is a bit too bright for an evening steakhouse, it takes away slightly from the cozy, old school atmosphere you’d expect. That said, the history, space, and service totally make up for it. Definitely worth going at least once, especially if you like classic NYC spots.",
    "review_rating": 5,
    "review_author": "Mat Israelson",
    "moods": [
      "work",
      "celebration",
      "date"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Keens Steakhouse",
    "city": "New York City",
    "place_id": "ChIJ5804KalZwokRzGll2Rm7nag",
    "review_text": "Me and my fiance have been coming to keens to celebrate my birthday, and other milestones for the last 4 years, and every time it delivers. Service is always outstanding, they’re attentive but not overbearing, we’ve eaten in pretty much every room and they are all wonderful. The Bar also serves its own menu as well as the main menu. Prime Rib Hash is a must if you’re eating at the Bar. The Prime Rib itself is a generous portion and always spot on, but their best cut will always be the goat. Can’t wait till our next dinner here.",
    "review_rating": 5,
    "review_author": "Johan Ruiz",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Pershing Square",
    "city": "New York City",
    "place_id": "ChIJBRoSgwFZwokRUSh30OTrJ6A",
    "review_text": "Best breakfast we had during our stay in NYC! We ate here the morning before flying out. They kindly stored our luggage while we ate. Our server was very nice and brought our food SUPER fast! All food was expertly prepared and delicious 😋 The Oatmeal and eggs benedict were amazing. Definitely get a booth with a window on either side of the restaurant to watch the passers-by!",
    "review_rating": 5,
    "review_author": "Sixing Zha",
    "moods": [
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Pershing Square",
    "city": "New York City",
    "place_id": "ChIJBRoSgwFZwokRUSh30OTrJ6A",
    "review_text": "Our favorite place for breakfast, brunch and lunch in Midtown. We’ve been dining here for 25 years and they never let us down.\n\nMy wife’s favorite is the Egg Benedict with Salmon. My go to is French Toast in the morning hours or a burger in the afternoon.\n\nAtmospheres is amazing, service is always solid and the location can’t be beat.",
    "review_rating": 5,
    "review_author": "David Barber",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Pershing Square",
    "city": "New York City",
    "place_id": "ChIJBRoSgwFZwokRUSh30OTrJ6A",
    "review_text": "My first time at Pershing Square and I was not disappointed! I ordered the fettuccine pasta with vegetables in a pesto sauce for lunch and it was amazing. The portion was generous and I ate the whole thing! Food baby! The service was great. As a matter fact, we had several servers and they were all very polite, friendly. Decent prices too. My entreé was $22.  The only thing I didn’t care for was how loud it was!  Overall, I highly recommend Pershing Square for a business lunch, out with friends, maybe not a first date if you want to talk and get to know each other.",
    "review_rating": 5,
    "review_author": "Kim Montalvo",
    "moods": [
      "work",
      "budget"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Pershing Square",
    "city": "New York City",
    "place_id": "ChIJBRoSgwFZwokRUSh30OTrJ6A",
    "review_text": "Eggs Benedict, Two Eggs Over Easy w/ Corned Beef Hash, and Coffee.\n\nFood/Value: A\nService/Wait Time: A\nDecor/Environment: A\nParking: N/A\n\nCash/Credit Cards: Yes\n\n*Photos by me\n\nFollow me on Instagram: @paulpaterakis\n\nTip me in Bitcoin: bc1q38ct2rawwn7jkg5ays5zvycxp8mj69e5q0zp2n",
    "review_rating": 5,
    "review_author": "Paul Paterakis",
    "moods": [
      "work",
      "budget"
    ],
    "mood_confidence": 0.6
  },
  {
    "restaurant_name": "Pershing Square",
    "city": "New York City",
    "place_id": "ChIJBRoSgwFZwokRUSh30OTrJ6A",
    "review_text": "The waffle was soft and tasty, but the downside is that it wasn’t crispy as expected.\nPrices are slightly on the higher side, however the service was fast and there was no waiting time, which is a big plus.\nOverall, a good experience and a nice spot for a quick, relaxed breakfast.",
    "review_rating": 4,
    "review_author": "Ree A",
    "moods": [
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Per Se",
    "city": "New York City",
    "place_id": "ChIJp3PsL_ZYwokRZYqs_40RJF4",
    "review_text": "As a flagship 3-star establishment, Per Se sets the global industry standard for culinary and service excellence. I brought my family here for a special occasion, and it was a flawless experience. Absolutely worth the price for a life event.\n\nThe Expert Perspective: My mother was a restaurateur in China, and even as a non-expert in French cuisine, she was shocked by the service execution. She noted that the team’s proactive attention to detail and synchronization are incredibly difficult to train—it is near flawless and justifies the prestige.\n\nThe Food: While the standard tasting menu is excellent, the culinary technicality is world-class. The flavors and presentation perfectly reflect the level of precision expected of Chef Keller. I’ve met people at luxury hotels worldwide who still talk about their proposals or milestone meals here; it’s a place for core memories.\n\nI hope to return in the near future for the \"Retrospective\" menu, which features the all-star signature dishes that defined the restaurant over the last 20 years.",
    "review_rating": 5,
    "review_author": "Simple as X",
    "moods": [
      "celebration",
      "work"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Per Se",
    "city": "New York City",
    "place_id": "ChIJp3PsL_ZYwokRZYqs_40RJF4",
    "review_text": "An unforgettable dining experience at Per Se, and one that truly lives up to every one of its three Michelin stars.\n\nFrom the moment you step into the main dining room, you’re immersed in elegance, a beautiful, serene setting overlooking the park, elevated further by the warm glow of the fireplace that creates an inviting and refined ambiance.\n\nThe tasting menu offered both vegetarian and meat/fish options. I chose the vegetarian menu, and it was hands down the most delicious tasting menu I’ve had in a long time. Every dish was thoughtful, balanced, and impeccably executed. The mushroom pie was absolutely out of this world- a luxurious blend of exotic mushrooms, seared to perfection, rich yet incredibly refined. The Doppio Agnolotti with butternut squash emulsion and chestnut confit was a standout as well, a flawless combination of sweetness, depth, and texture.\n\nThe meat menu was equally impressive. The perfectly seared Mediterranean Lubina and the delicately cooked farmed venison showcased remarkable technique and flavor, leaving nothing to be desired.\n\nService elevated the experience even further. Samantha, our server, was exceptional- warm, attentive, and impressively knowledgeable about every dish, making the meal feel both personal and seamless.\n\nPer Se is truly worthy of each and every star. A flawless culinary journey from start to finish, and an experience I will remember for a long time to come.",
    "review_rating": 5,
    "review_author": "Esfira Shakh",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Per Se",
    "city": "New York City",
    "place_id": "ChIJp3PsL_ZYwokRZYqs_40RJF4",
    "review_text": "Background\nPer Se is synonymous with a rigorously precise, French inspired tasting menu experience. Even its shorter menus are designed to reflect the full philosophy of the kitchen rather than serve as a compromise.\n\nAmbience\nThe dining room is dimly lit and serene. While we were not seated in the main dining hall, our table faced the New York skyline, which added a cinematic calm to the evening. The space felt formal yet not stiff, elegant without intimidation.\n\nService\nService was impeccable and precise. Staff were attentive without hovering and thoughtful without excess. The presence of a vegetarian menu executed with equal seriousness deserves special praise.\n\nFood and drink\nThe four course menu was skilfully crafted and coherent from start to finish. Each plate showed restraint and clarity. The true revelation was the dessert course. It was a masterpiece of balance and whimsy, arguably the most compelling and memorable sequence of the meal. It is one of the best if not the best dessert. Kudos\n\nOverall\nPer Se proves that greatness is not dependent on length or spectacle. Even a shorter menu delivers depth, confidence and emotional payoff.",
    "review_rating": 5,
    "review_author": "Peter Gan",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Per Se",
    "city": "New York City",
    "place_id": "ChIJp3PsL_ZYwokRZYqs_40RJF4",
    "review_text": "I can't imagine a much more opulent and elegant way to welcome the New Year. It is said, that you should welcome the new year in the way you would like your Year to be. Cheers to being off to a magnificent start! We also decided to do the recommended wine pairing which was a fantastic choice! Each dish was artfully created.\nAdmittedly, one of my favorite aspects was the very thoughtfully curated gift bag we were sent home with. What a treat to enjoy on New Year's Day! The gift that keeps giving!",
    "review_rating": 5,
    "review_author": "Heather Dolland Tamam",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.95
  },
  {
    "restaurant_name": "Per Se",
    "city": "New York City",
    "place_id": "ChIJp3PsL_ZYwokRZYqs_40RJF4",
    "review_text": "A memorable meal with family before Christmas. We celebrated my mom's 70th birthday while dining as well. This was our second visit to Per Se and it was consistent with my first visit. While I wasn't blown away this time, the dishes were executed with high degree of skill and technique. This visit just felt average in terms of the menu making an impression. For the price tag I feel like there needs to be a bigger wow factor. The service is impeccable though! I would definitely recommend dining here for a splurge and a special treat.",
    "review_rating": 4,
    "review_author": "Weston Corbin",
    "moods": [
      "celebration",
      "family"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "burger joint",
    "city": "New York City",
    "place_id": "ChIJwfFb4flYwokRP78kZ3ER5a8",
    "review_text": "This was the first place that I went to when I arrived in NYC. First of all locating the restaurant feels like an insiders secret. You enter through an unassuming hotel lobby, make a right, push through the red curtain at the top of the stairs and there you have burger joint. No frills, cash only, quality burgers. Ended up taking quite a while to get our food, but that gives you time to find a seat. To say it’s competitive for that is an understatement. I loved this place and it ended up being one of my favorite meals of the whole trip. Cannot recommend enough.",
    "review_rating": 5,
    "review_author": "Arron",
    "moods": [
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "burger joint",
    "city": "New York City",
    "place_id": "ChIJwfFb4flYwokRP78kZ3ER5a8",
    "review_text": "Access is through Thompson Central Park Hotel lobby through a red curtain.  It's a hole in the wall with an eclectic vibe.  Don't be fooled by the casual fast food type service.  Burger joint burgers are probably the best I've ever had.  They are a bit pricey about 24 bucks but they are also a good size.  I had the double cheeseburger and had a hard time finishing it.",
    "review_rating": 5,
    "review_author": "Betty Galarza",
    "moods": [
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "burger joint",
    "city": "New York City",
    "place_id": "ChIJwfFb4flYwokRP78kZ3ER5a8",
    "review_text": "Burger is quite pricey (~$25) but tasty! The whole vibe of this place is very cool. The patties are thick cut and all the toppings are fresh and prepped to order. I personally preferred the thick crinkle cut sweet potato fries over the regular shoestring fries. Super friendly staff",
    "review_rating": 5,
    "review_author": "Marc Sleiman",
    "moods": [
      "quick_bite"
    ],
    "mood_confidence": 0.6
  },
  {
    "restaurant_name": "burger joint",
    "city": "New York City",
    "place_id": "ChIJwfFb4flYwokRP78kZ3ER5a8",
    "review_text": "Overhyped place and popular among tourists, I should have just sticked to the old time favorites Shake Shack and 7th Street Burgers. Having said that, it’s a new experience. Being a local, we try and we avoid if it dissatisfies you.\n\nI don’t want to mislead people, but avoid this place. It’s crowded, no one cleans the table, you’d seat on a catsup on the chair, lettuce on the table, or sleeves will catch mayonnaise if you eat and lean on the table. Look first before you seat.\n\nThe patties were unfresh, buns were ordinary, McDonald’s has better fries, and mass produced sweet potatoe fries. Nothing is fresh but lettuce and tomatoes.\n\nYou’ll eat and speed away because tourists will be like hawk eyeing your table, approach you and wait next to you, watching your every chew and silently asking to go now so it’ll be their turn to seat.",
    "review_rating": 1,
    "review_author": "Ryan Tan",
    "moods": [
      "quick_bite"
    ],
    "mood_confidence": 0.6
  },
  {
    "restaurant_name": "Daniel",
    "city": "New York City",
    "place_id": "ChIJ09ZGju5YwokRXOcNC23JRwk",
    "review_text": "This was my second time dining at DANIEL, and once again it reminded me why this restaurant is so special and why I return every time I’m in New York City.\n\nFrom the moment we walked in, we were greeted with genuine warmth and gracious hospitality. The host and the manager who seated us were welcoming, attentive, and made us feel truly cared for. Throughout the evening, the service was impeccable ,polished yet friendly, professional without ever feeling distant.\n\nThe sommelier was exceptional, offering thoughtful wine recommendations that paired beautifully with each course. The tasting menu was a true work of art: beautifully crafted dishes, elegant plating, balanced flavors, and pairings that elevated the entire experience. Every course felt intentional and refined, yet comforting at the same time.\n\nOne of the highlights of the evening was having the pleasure of meeting Daniel Boulud himself. Despite being incredibly busy and on his feet all evening, his passion for cooking and hospitality truly shines through. He took the time to stop, chat with guests, and make everyone feel welcome and happy  a rare and meaningful gesture from a world-renowned chef.\n\nDANIEL is not just about extraordinary food; it’s about heart, warmth, and genuine hospitality. An unforgettable experience, every single time.",
    "review_rating": 5,
    "review_author": "Par Chiturai",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Daniel",
    "city": "New York City",
    "place_id": "ChIJ09ZGju5YwokRXOcNC23JRwk",
    "review_text": "I recently visited Daniel in New York City and experienced their tasting menu, and the entire evening was truly exceptional. From the moment I arrived, the service was warm, welcoming, and incredibly professional. The staff guided each course with genuine knowledge and attention, making the meal feel effortless and perfectly paced.\n\nThe tasting menu itself was a remarkable journey. Every dish was beautifully presented with meticulous detail, showcasing refined technique and bold yet balanced flavors. Each course felt intentional—textures, colors, and tastes coming together in a way that showed the kitchen’s skill and creativity. The ingredients were clearly top-quality, and the transitions between courses were thoughtful and harmonious.\n\nThe wine pairings elevated the experience even further, complementing each dish without overwhelming it. The ambiance of the dining room added to the enjoyment—elegant, serene, and polished without feeling stiff or overly formal. It created an atmosphere where you could relax and truly savor every moment.\n\nOverall, my experience at Daniel was extremely pleasant and memorable. The tasting menu was refined, artful, and satisfying, and the impeccable service made the evening feel special from start to finish. I would gladly return for another celebration or fine-dining experience.",
    "review_rating": 5,
    "review_author": "Charlotte Saint-Hague",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Daniel",
    "city": "New York City",
    "place_id": "ChIJ09ZGju5YwokRXOcNC23JRwk",
    "review_text": "I recently visited with my sister, Tina Stewart, who has raved about Daniel for quite some time — and now I completely understand why. From the moment we arrived, the entire experience was nothing short of exceptional.\n\nThe wait staff was absolutely top notch — Zach, Matt, and the bartenders all went above and beyond. Attentive, knowledgeable, welcoming, and genuinely kind. You could tell they take pride not only in their work but in the experience they create for every guest.\n\nThe food… there truly are no words. Every bite was incredible. Flavorful, thoughtfully prepared, and clearly made with passion. Getting the opportunity to see the kitchen was an added bonus and only deepened my appreciation for the care and skill that goes into each dish.\n\nIt was an amazing night filled with outstanding food and even better people. Experiences like this stay with you — they aren’t just meals, they’re memories.\n\nUntil next year, I wish you all a fantastic year ahead. This is an absolute must-go place. If you get the chance, you owe it to yourself to have this experience at least once in your life. ⭐⭐⭐⭐⭐",
    "review_rating": 5,
    "review_author": "Jamie Terhaar",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Daniel",
    "city": "New York City",
    "place_id": "ChIJ09ZGju5YwokRXOcNC23JRwk",
    "review_text": "Dining at Daniel is always an unforgettable experience, and last night’s Chef’s Menu reminded me once again why we return to Chef Daniel’s restaurants so often.\nEvery single dish was a masterpiece, beautifully plated, thoughtfully crafted, and bursting with exquisite flavor combinations that are truly unique. It’s impossible to choose a favorite because each course was exceptional in its own way, both in taste and presentation.\nThe entire experience felt refined, balanced, and remarkably harmonious. You can feel the passion, creativity, and precision behind every creation.\nWe frequently visit Chef Daniel’s various restaurants, and each one has its own signature charm.\nThank you for an extraordinary evening and a gastronomic journey we will always remember. We look forward to coming back soon. ✨",
    "review_rating": 5,
    "review_author": "Veronika Kvaratskhelia",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Daniel",
    "city": "New York City",
    "place_id": "ChIJ09ZGju5YwokRXOcNC23JRwk",
    "review_text": "Daniel is absolutely one of our top picks overall. We had the 7 course tasters experience. We enjoyed everything! The food, the drinks, the service, all excellent! After a great dinner, we really look forward to a special desert. Daniel supplied all kinds of delicious sweet little goodies that we absolutely enjoyed. I also must note, which is important to me, the table & chairs are very comfortable.  Everything was exceptional. Daniel did not charge any hidden fees or service & admin charges like some other restaurants that we've been to.  Nor did Daniel charge us an automatic gratuity charge. Now that's what I call good business! Thank you!  We will be back! Daniel is very worthy of its Michelin star!",
    "review_rating": 5,
    "review_author": "JaySan Avante",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Hard Rock Cafe",
    "city": "New York City",
    "place_id": "ChIJh3tl5lRYwokRtY1QuaZADu0",
    "review_text": "Hard Rock don't need reviews, it's just one of the best places you can go, have fun, good food and enjoy the amazing atmosphere that they always have.\n\nThe service is just lovely and unique, from the hosts to the waiters, they all have a lovely energy and you can feel they really love to work there.\n\n100% recommended and I recommend to reserve before you go. I used open table app everytime that I go to a Hard Rock or other restaurants, it's hassle free and very easy to use and reserve a table.",
    "review_rating": 5,
    "review_author": "FABIAN ARCE",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Hard Rock Cafe",
    "city": "New York City",
    "place_id": "ChIJh3tl5lRYwokRtY1QuaZADu0",
    "review_text": "Great location right on time square. Not much more to say about hard rock that hasn't been said before. We went during the week. We might have waited a couple of minutes to be seated. I've been to multiple locations for Hard Rock and this by far was one of the larger locations I've been to. We sat at the bar which has plenty of room available. The food came out really fast and was excellent. The service from the bartender was amazing. The location is definitely worth a visit if you have the time while you are in New York City.",
    "review_rating": 5,
    "review_author": "Diego Perez",
    "moods": [
      "celebration",
      "quick_bite"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Hard Rock Cafe",
    "city": "New York City",
    "place_id": "ChIJh3tl5lRYwokRtY1QuaZADu0",
    "review_text": "KIKI IS WONDERFUL!! We had the pleasure of having her as our server today and she made the whole experience wonderful. She was kind and genuinely friendly and always came over with a smile. She helped with food recommendations and really went the extra mile. Can’t say enough great things about her. The food was amazing!",
    "review_rating": 5,
    "review_author": "Jeanette Cecce",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Hard Rock Cafe",
    "city": "New York City",
    "place_id": "ChIJh3tl5lRYwokRtY1QuaZADu0",
    "review_text": "I thoroughly enjoyed my experience at this iconic cafe. I can’t say I enjoyed the food and the queue for coffee was too long and they ran out regularly but I wouldn’t have missed the experience for the world. The memorabilia on display is so impressive and all the staff were very pleasant. My son and grandson will love the T-shirts I bought them. If you enjoy what we call in Australia ‘Pub style food’ you will love it! 🎸❤️🎸❤️🎸",
    "review_rating": 4,
    "review_author": "Jennifer Kellett",
    "moods": [
      "family",
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Hard Rock Cafe",
    "city": "New York City",
    "place_id": "ChIJh3tl5lRYwokRtY1QuaZADu0",
    "review_text": "Great experience at Hard Rock.\nFrom the moment we arrived, the atmosphere was very calm and enjoyable, perfect for relaxing and having a good time. The food was delicious and well prepared.\n\nI especially want to highlight our server Jayda — she was super friendly, attentive, and always smiling. She truly made our experience even better.\n\nI would definitely come back and highly recommend this place.",
    "review_rating": 5,
    "review_author": "Mateo Cortes",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Red Lobster",
    "city": "New York City",
    "place_id": "ChIJc4euylRYwokRnweuR3UzKYI",
    "review_text": "My girlfriend and I had the best time ever!! I haven't been here in a while and she made it so fun and memorable from her service and smile to how attentive to detail she was! Her food recommendations were on point! Hope you guys treat her well she deserves it! Cindy was also so pleasant and makes sure everything was ok. Thanks again\nP.S. She even celebrated my early birthday! I so appreciate it",
    "review_rating": 5,
    "review_author": "Claudia Estrada",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Red Lobster",
    "city": "New York City",
    "place_id": "ChIJc4euylRYwokRnweuR3UzKYI",
    "review_text": "Donna was absolutely amazing from the greet. She helped us achieve all of our Red Lobster dreams. The food was delicious, biscuits were hot and fresh. She made sure we had everything we needed and went above and beyond for us. Making our Wednesday lunch more than we could have ever imagined and best of 2026. Thank you Donna !!!",
    "review_rating": 5,
    "review_author": "leeanne dixon",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Red Lobster",
    "city": "New York City",
    "place_id": "ChIJc4euylRYwokRnweuR3UzKYI",
    "review_text": "Stephanie took really great care of us and attended to our table with the upmost consideration for our dining experience. seasoned professional that went above and beyond to correct and ensure we enjoyed ourselves. the food was fresh, seasoned, and came out pretty fast considering we entered about 45 minutes before closing. i was surprised. the menu specials are great too and worth it. 10/10",
    "review_rating": 5,
    "review_author": "Ashley Kay",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Red Lobster",
    "city": "New York City",
    "place_id": "ChIJc4euylRYwokRnweuR3UzKYI",
    "review_text": "I had an amazing experience dining here, and a huge part of that was thanks to our waitress, Jayy. From the moment we sat down, she was incredibly attentive, responsive, and on point with everything we needed. She checked in at the perfect times, kept our drinks filled, and made sure we were comfortable without ever hovering.\n\nThe food was absolutely fire — fresh, flavorful, and came out exactly how we ordered it. On top of that, the music set the perfect vibe, making the whole experience even better.\n\nJayy’s energy and professionalism really elevated the night. If you come here, definitely ask for her. You won’t be disappointed!",
    "review_rating": 5,
    "review_author": "Julian fitzgerald",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Red Lobster",
    "city": "New York City",
    "place_id": "ChIJc4euylRYwokRnweuR3UzKYI",
    "review_text": "My server was Emily V and she was FANTASTIC. She had clear communication,  attention to detail, and you could tell she was on her P’s and Q’s just hearing her bounce from table to table; Laziness was the last thing going on. The food was good and the atmosphere was much appreciated. Another noteworthy detail is that every restaurant in the area had a 35-45 min walk-in wait time, and Red Lobster took us IMMEDIATELY (a table of two). Overall everything was pleasing. The highest appreciation hands down goes to the server; Emily is awesome! (Peep the wood handle photo)",
    "review_rating": 5,
    "review_author": "Ryan",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Quality Meats",
    "city": "New York City",
    "place_id": "ChIJo8ujsPBYwokRbJ1cEtujTcc",
    "review_text": "The food was very good and came out quickly. The service was excellant and all the dishes were uniquely plated. You can tell the kitchen team enjoy plating good food! There atmosphere had a layed back vibe and had a variety of levels for dining, intimate space, bar space, or business occasion. We had a business dinner for four people but it was a little tight on seating, and a touch loud but that is NYC for ya. I would definitely eat there again!",
    "review_rating": 5,
    "review_author": "William B",
    "moods": [
      "work",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Quality Meats",
    "city": "New York City",
    "place_id": "ChIJo8ujsPBYwokRbJ1cEtujTcc",
    "review_text": "This is definitely my favorite steakhouse! The steaks are always cooked perfectly (we ordered medium), full of flavor, and the quality is consistently amazing. The server was amazing and the atmosphere was great. Made the whole dining experience even better.",
    "review_rating": 5,
    "review_author": "Jennie Nguyen",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Quality Meats",
    "city": "New York City",
    "place_id": "ChIJo8ujsPBYwokRbJ1cEtujTcc",
    "review_text": "Quality Meats – The Perfect NYC Steakhouse Experience 🥩✨\n\nIf you’re craving a luxe night out in the city, Quality Meats is the spot. From the moment you walk in, the ambiance hits warm lighting, cozy but upscale energy, and that classic New York steakhouse charm with a modern twist.\n\nI started with a glass of white wine at the bar (10/10 vibes). The staff was so attentive and made me feel taken care of the entire evening. For dinner, I had the filet mignon cooked to absolute perfection juicy, tender, and full of flavor. The sides were unreal crispy brussels sprouts, creamy mac & cheese, and the most buttery dinner rolls. Everything looked and tasted amazing.\n\nThen came dessert… oh my God. The sticky toffee pudding with vanilla ice cream and caramel drizzle was pure heaven sweet, rich, and the perfect ending to an unforgettable meal.\n\nIf you love fine dining with personality, this place deserves a top spot on your list. Whether you’re celebrating something special or just treating yourself, Quality Meats delivers elegance, flavor, and that signature NYC magic.\n\n📍 Midtown, NYC\n🍷 Must-try: Filet Mignon + Sticky Toffee Pudding\n💫 Perfect for: Date night, business dinner, or solo luxury dining moment",
    "review_rating": 5,
    "review_author": "CIAMERA JIMENEZ",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Quality Meats",
    "city": "New York City",
    "place_id": "ChIJo8ujsPBYwokRbJ1cEtujTcc",
    "review_text": "Wait time: immediate, RSVP is highly encouraged! It’s quick and easy to do online or by calling.\n\nHostess: Kind, Friendly and welcoming. We were promptly greeted and showed to our table.\n\nServer: Our server Stacy was phenomenal, she provided us the most in depth knowledge of the menu and gave us some great recommendations! Thank you for the amazing service, you were so sweet and polite.\n\nFood: Everything was exquisite, and so well prepared. The flavor combinations explode in your mouth from the minute the food hits your tongue. Our group ordered and rated the following.\n\nSTATERS:\n-Crab and Avocado (8/10) dish is served cold.\n-Grilled Bacon, Peanut Butter & Jalapeño (Don’t knock it till you try it) (9/10)\n\nTHE MEATS\n-NY Steak strip (9/10) Medium Rare\n-28 Day Dry-Aged Porterhouse (10/10) (feeds 2-3 people) Medium Rare\n\nMAINS\n-Bacon & Blue Burger (8.5/10)\n-Roasted Chicken & Kumquats (8/10)\n\nSIDES\n-Corn Créme Brûlée (10/10) this is not a dessert! It’s the most delicious side you’ll ever have. It’s a house favorite.\n\nDESSERT\n-Sticky Toffee Pudding (10/10) MUST HAVE\n\nAmbiance: Beautiful design, floor outline and table placements. Lighting is optimal and clear to fully read the menu without squinting. Music was just perfect and great choices being played. We could still hold a conversation without yelling.\n\nRestrooms:  Very clean, Well maintained and fully stocked.\n\nCleanliness: Spotless! You could eat off the floor.\n\nTiming: Food was promptly brought out, cooked to perfection! Everything came out at the same time. The meats were perfectly cooked to the requested temperatures.\n\nLikeliness to return: Very High\n\nConsider Alternatives: NONE\n\nAdditional Comments: This 2 story building offers lots of available seating. Second floor has private rooms for events and party’s. Wine selection is unbelievably large and they also provide recommendations for pairing with your food. Kitchen closes at 3 to prepare for dinner, but the restaurant is still open (don’t let the online time confuse you)",
    "review_rating": 5,
    "review_author": "Abraham Pineiro",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Quality Meats",
    "city": "New York City",
    "place_id": "ChIJo8ujsPBYwokRbJ1cEtujTcc",
    "review_text": "Great food, great service, great atmosphere.  Loved everything about this restaurant.  For a steakhouse I think it is very casual, not at all stuffy.  Caviar sliders were very good and being able to order by the piece allows you to try it and still have room for everything else. Tartare was very good. Mixed table side  is a nice presentation but the tables are very small so it is a little cramped.  Steak cooked to perfection and seasoned well.  Its a very little thing but for me little things natter, there is a pepper mill and small bowl of salt on every table.  That isn’t common lately and I think it’s a great touch especially at a steak house.   The green goddess salad was okay.  Nothing special.  Wine selection is vast with many price points.  The sommelier was very helpful. Overall a great dining experience and will definitely return.",
    "review_rating": 5,
    "review_author": "Kathy D",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Sophie's Cuban Cuisine - Midtown West",
    "city": "New York City",
    "place_id": "ChIJPwTctf9YwokRA_WDoKKwfZE",
    "review_text": "Love going to Sophie’s on 45 th\nI usually order delivery but going there and sitting down in the back is very nice too\nStaff is great and the food is delicious\nI split my portion as it’s really a good amount of food for lunch",
    "review_rating": 5,
    "review_author": "fara blanco",
    "moods": [
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Sophie's Cuban Cuisine - Midtown West",
    "city": "New York City",
    "place_id": "ChIJPwTctf9YwokRA_WDoKKwfZE",
    "review_text": "This spot handled my birthday celebration perfectly. Our worker's friendly nature enhanced the experience. This place balances culinary quality, environmental quality and service quality. Their prices are fair and ingredients are newly sourced. Trust me, this place has my loyalty, and it'll earn yours too.",
    "review_rating": 5,
    "review_author": "Juan King",
    "moods": [
      "celebration",
      "budget"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Olive Garden Italian Restaurant",
    "city": "New York City",
    "place_id": "ChIJM3wn3VVYwokRvu2kbqBKUsM",
    "review_text": "🍝 Olive Garden Times Square — Comfort Italian Dining in the Heart of New York\n\nOne of the restaurants I chose for a proper sit-down meal during my time in Times Square, New York, was Olive Garden. After a full day of walking, sightseeing, and soaking in the energy of the city, this place felt like a comfortable and familiar stop for a hearty Italian-style dinner right in the middle of Manhattan.\n\nOlive Garden is an Italian-American restaurant chain that was founded in 1982 in Florida, USA. The concept behind the brand is simple: serve Italian-inspired dishes that are generous in portion, rich in flavor, and easy to enjoy. Over the years, Olive Garden has grown into one of the most recognizable casual dining restaurants in the United States, and the Times Square location is especially popular among tourists from all over the world.\n\n📍 Location\nOlive Garden Times Square is located in the Theater District, just steps away from Times Square itself. The location is extremely convenient, whether you are coming from shopping areas, nearby attractions, or planning to watch a Broadway show. Several subway lines are within walking distance, making it very easy to reach.\n\n🍝 Must-Try Popular Dishes\nOne of the highlights of dining at Olive Garden is the complimentary Unlimited Breadsticks and House Salad. The warm breadsticks are soft, buttery, and addictive, while the fresh salad with the signature dressing is light and refreshing.\n\nFor main dishes, the most popular menu items include:\n•\tFettuccine Alfredo, a classic favorite featuring flat pasta coated in a rich, creamy parmesan sauce\n•\tChicken Parmigiana, breaded chicken topped with tomato sauce and melted cheese, served with spaghetti\n•\tShrimp Scampi, sautéed shrimp with garlic and white wine sauce, offering a lighter and fresher taste\n•\tLasagna Classico, layered pasta with meat sauce and cheese for those who want something filling\n\nFor dessert, Tiramisu is a top choice, offering a perfect balance of coffee flavor and creamy sweetness.\n\n⏰ Opening Hours\nOlive Garden Times Square is generally open daily from around 11:00 AM to 11:00 PM, though hours may be extended during weekends or peak tourist seasons.\n\n💰 Prices\nConsidering the location and portion sizes, the prices are reasonable:\n•\tMain dishes usually range from $20 to $30\n•\tDesserts are around $8 to $10\n•\tThe unlimited breadsticks and salad make the meal feel even more worth the price\n\n🏡 Atmosphere\nThe restaurant is spacious with plenty of seating, making it suitable for families, couples, and groups. Despite being in a busy area like Times Square, the interior feels warm and welcoming, with a casual Italian ambiance. The service is efficient and friendly, even during busy dinner hours.\n\n✨ Final Thoughts\n\nOlive Garden Times Square is a reliable choice if you are looking for a satisfying Italian-style meal in a comfortable setting. The food is hearty, the portions are generous, and the location is perfect for tourists. For anyone wanting a relaxed dinner after exploring New York City, this restaurant is definitely worth a visit.",
    "review_rating": 5,
    "review_author": "Sirichai Jiwasurat",
    "moods": [
      "family",
      "celebration",
      "budget"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Olive Garden Italian Restaurant",
    "city": "New York City",
    "place_id": "ChIJM3wn3VVYwokRvu2kbqBKUsM",
    "review_text": "⭐️⭐️⭐️⭐️⭐️ Amazing Dining Experience at Olive Garden – 2 Times Square, New York!\nI recently visited the Olive Garden Italian Restaurant located at 2 Times Square, and I have to say—it was an absolutely wonderful experience from start to finish!\nFrom the moment I walked in, the staff made me feel genuinely welcome. The service was truly excellent—attentive, warm, and perfectly paced. Every team member I interacted with went above and beyond to ensure I had everything I needed, all while maintaining a friendly and professional attitude.\nAnd the food… wow. Every dish was packed with flavor, beautifully prepared, and incredibly satisfying. The pasta was perfectly cooked, the sauces were rich and fresh, and even the classic breadsticks were warm and irresistible. You can really taste the care that goes into each plate.\nWhether you’re a local or just visiting Times Square, this Olive Garden is a fantastic choice for a relaxing and delicious Italian meal in the middle of the city’s excitement. I left completely happy and definitely planning to return soon.\nHighly recommend! 🍝✨",
    "review_rating": 5,
    "review_author": "Deniz Sahile",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Olive Garden Italian Restaurant",
    "city": "New York City",
    "place_id": "ChIJM3wn3VVYwokRvu2kbqBKUsM",
    "review_text": "Olive Garden used to be one of my favorite restaurants—great food, great ambiance—but it’s definitely going downhill, or maybe it was just this specific location (Downtown Manhattan).\n\nThe place is huge, clearly designed to handle large crowds since it’s in the heart of a major tourist area. Although the restaurant was full, we were seated immediately, which was impressive.\n\nWe ordered the shrimp fettuccine Alfredo, which was surprisingly bland—no flavor, not even salt. The lasagna tasted like a store-bought frozen meal: dry on the inside and drowned in a thick sauce that didn’t complement it well.\n\nThe main course came with a large shared salad and some breadsticks, both at no extra cost. When we asked for olive oil and butter, the staff brought them right away, again free of charge—which was appreciated.\n\nI also ordered a beer and a margarita; my friend found the margarita overly sweet and hard to enjoy.\n\nThe highlight of the visit was definitely the service. Our waiter Anthony was outstanding—friendly, knowledgeable, and very attentive. All the other staff were pleasant and professional too.\n\n⸻\n\nOverall:\nGreat service, but unfortunately, the food didn’t meet expectations. Hoping it was just an off day for this location.",
    "review_rating": 3,
    "review_author": "Lis Tho",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Olive Garden Italian Restaurant",
    "city": "New York City",
    "place_id": "ChIJM3wn3VVYwokRvu2kbqBKUsM",
    "review_text": "For those of you who are disabled, this Olive Garden does have an elevator!! My mom and I came in at about 5-5:30pm-ish and were going to see Beetlejuice at the Palace Theatre at 7pm. We didn't have a reservation but they were able to seat us immediately. We told our server we were going to see a show at 7 and he was able make sure to get our food out fast. The food was great--I'm so glad they brought back the stuffed chicken marsala, it's my favorite menu item. And the service was great!",
    "review_rating": 5,
    "review_author": "Macayla S",
    "moods": [
      "quick_bite",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Olive Garden Italian Restaurant",
    "city": "New York City",
    "place_id": "ChIJM3wn3VVYwokRvu2kbqBKUsM",
    "review_text": "First time at Olive Garden. Got the unlimited pasta deal w/ my friends for the memes. Felt so sick after bc I ate so much - couldn’t eat any pasta for a month after 😭 False fire alarm went off while we were here LMAO\n\n- Never ending pasta bowl ($19.99): 5/10, could only eat 2 bowls of pasta + 1 bowl of soup. Tomato sauces >>> cheese sauces. The bread sticks are fire. Everything was too salty LOL, esp the meats",
    "review_rating": 3,
    "review_author": "Mei Deng",
    "moods": [
      "celebration",
      "quick_bite"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "The Smith",
    "city": "New York City",
    "place_id": "ChIJzd_ZRgJZwokRnzXTa1YVpko",
    "review_text": "The place was nice, staff was friendly, food was very good. However, we specifically asked to not be rushed, we wanted to take our time. We were told that was no problem. The food came out minutes after we ordered it. We were rushed. I'm just tired of always being as a table to turn over for the next.",
    "review_rating": 4,
    "review_author": "Ellen Holland",
    "moods": [
      "quick_bite"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "The Smith",
    "city": "New York City",
    "place_id": "ChIJzd_ZRgJZwokRnzXTa1YVpko",
    "review_text": "We came at around 9:30pm, and just did an appetizer night. We did The Grand which is an oyster tower with shrimp and spicy tuna tartare. It was amazing and great for 2ppl to share.\n\nThen we did the Burrata, and Chicken Nuggets. The BREAD for the burrata was so great and warm, and the burrata itself was very milky.\n\nFinally, living up to expectations so far - the Chicken nuggets were fresh, soft and perfectly breaded. Definitely not some generic frozen stuff.\n\nGreat first time experience here. Also the wine and cocktails are great.",
    "review_rating": 5,
    "review_author": "Wil Rampersaud",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "The Smith",
    "city": "New York City",
    "place_id": "ChIJzd_ZRgJZwokRnzXTa1YVpko",
    "review_text": "Excellent brunch spot! We loved the fresh-squeezed orange juice, and both of our dishes hit the spot. The burger was juicy and flavorful, and the eggs, bacon, and potato pancake were cooked perfectly. Lively atmosphere and a solid choice for a relaxed weekend brunch.",
    "review_rating": 5,
    "review_author": "Courtnie Clemens",
    "moods": [
      "quick_bite",
      "family"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "The Smith",
    "city": "New York City",
    "place_id": "ChIJzd_ZRgJZwokRnzXTa1YVpko",
    "review_text": "First, Zack G did a wonderful job serving our group, friendly and quite helpful.  Our meals were nicely done as well.  I ordered the spicy shrimp scampi and it was very flavorfulnand I appreciated that it actually had a nice spice to it.  Only thought I'd offer is with such a nice looking bar would have preferred a martini with a little more substance - it was average.  All in all, we had a great experience.",
    "review_rating": 5,
    "review_author": "Chris Thompson",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Stout NYC",
    "city": "New York City",
    "place_id": "ChIJJ91wx65ZwokRnjW2e69Imic",
    "review_text": "Come for the sports, stay because the burger changed your life.\nHonestly, usually \"NYC sports bar\" = \"standing in someone’s armpit,\" but Stout is actually beautiful inside? The layout is great and the flow makes sense—you aren't bumping into 50 people just to get to the restroom.\nGreat location near the Garden.\nLove the cobblestone floors!\nIf you have eyeballs and like sports, this is the spot. The TV setup is elite; there isn't a bad seat in the house. Definitely check out the downstairs area too, it’s a whole vibe down there.\nThe staff were absolute legends—super friendly and fast. And whatever you do, order the smash burger. It was awesome. I might dream about it later.\nHighly recommend!",
    "review_rating": 5,
    "review_author": "John “JV”",
    "moods": [
      "quick_bite",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Stout NYC",
    "city": "New York City",
    "place_id": "ChIJJ91wx65ZwokRnjW2e69Imic",
    "review_text": "After being ignored at another bar nearby, we decided to leave and come here instead and I’m really glad we did. The difference in service was immediate. Gaston was incredibly friendly, attentive, and genuinely welcoming from the moment we sat down. He went out of his way to help us get connected to the WiFi so we could get some work done from Stout, which was greatly appreciated. The WiFi itself worked very well and made it easy to stay productive while enjoying the space. Overall, great service, a comfortable atmosphere, and a big shoutout to Gaston for turning the experience into a great one. Would definitely come back",
    "review_rating": 5,
    "review_author": "Felipe Castillo",
    "moods": [
      "work"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Stout NYC",
    "city": "New York City",
    "place_id": "ChIJJ91wx65ZwokRnjW2e69Imic",
    "review_text": "This place is a staple for my work group. We grab a drink and quick meal from this place nearly every time we meet in the city — we’ve tried other places but always end up back here. Good environment, good food, good drinks! We’re not even there for the sports, but there is definitely a sporty presence. Reasonably priced as well, which is super important.",
    "review_rating": 5,
    "review_author": "Brenna Croker",
    "moods": [
      "work",
      "budget",
      "quick_bite"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Stout NYC",
    "city": "New York City",
    "place_id": "ChIJJ91wx65ZwokRnjW2e69Imic",
    "review_text": "Busy venue with a great atmosphere. The waitress that served us was great! I cannot recall her name, but she told me she could instantly tell when we were trying to get her attention. She had a great sense of humour and was \"on the ball\". Loved our visit. I will definitely go back.",
    "review_rating": 5,
    "review_author": "Nick Henderson",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.6
  },
  {
    "restaurant_name": "Stout NYC",
    "city": "New York City",
    "place_id": "ChIJJ91wx65ZwokRnjW2e69Imic",
    "review_text": "We were looking for a place to have food and a drink. The security guy surprised us with the warmest welcome ever (quite rare in NYC to be honest). The amazing greetings already gave us a good vibe, and the food didn't disappoint at all. Delicious place I sincerely recommend!",
    "review_rating": 5,
    "review_author": "Ann Sergeeva",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.6
  },
  {
    "restaurant_name": "Nobu Fifty Seven",
    "city": "New York City",
    "place_id": "ChIJPX5iCfpYwokRACnACAf2pJw",
    "review_text": "Went on a Friday night and it was busy but the staff was very attentive . Great vibe .\nI had the lychee martini and they were great. To eat I had the lobster tacos, shrimp tempura, the rice cake, tiradito and Toro roll. It was so delicious and I want to go again. Dishes are shareable. Very nice for a date night or just a night out with your girls/friends.\n\n**went again 10/24** amazing service !  I love how they tell you how to eat the dish  and what’s part of each dish. Very clean and efficient service! Got sat at the counter but enjoyed watching the amazing chefs at work. Had the tiradito again and crispy rice. Lobster taco and wagyu taco, rock shrimp and the ribeye were all delicious. My bf loved the old fashion . Had the banana pudding for desert! Amazing",
    "review_rating": 5,
    "review_author": "macii c",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Nobu Fifty Seven",
    "city": "New York City",
    "place_id": "ChIJPX5iCfpYwokRACnACAf2pJw",
    "review_text": "This is my husband and I’s third time at this Nobu location and the food is always perfection!! We were celebrating our anniversary and we couldn’t have chosen a better place! Service was impeccable, and we did not leave hungry! Definitely recommend to anyone in the area that wants an amazing meal! We will be back!",
    "review_rating": 5,
    "review_author": "Elizabeth Connor",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Nobu Fifty Seven",
    "city": "New York City",
    "place_id": "ChIJPX5iCfpYwokRACnACAf2pJw",
    "review_text": "I recently had dinner at Nobu in New York and overall it was a very good experience. We had a reservation for 10 p.m. and still waited about ten minutes to be seated, which wasn’t too bad, but worth noting given how busy the restaurant stays. The atmosphere inside is sleek and modern, and the service was attentive without feeling rushed.\nWe started with drinks and ordered the Coconut Matcha and the Lychee Martini. The Coconut Matcha was smooth and lightly sweet, and I really enjoyed it. The Lychee Martini had a refreshing floral flavor but was a little strong for me, so I didn’t enjoy it quite as much.\nFor appetizers, the standout for me was the yellowtail sashimi with jalapeño. It had a bright, slightly sour citrus note that paired perfectly with the subtle heat from the jalapeño. It was easily my favorite dish of the night. We also tried the crispy rice with spicy tuna. The tuna itself was creamy and flavorful, but the rice was a bit too crispy for my taste and left the top of my mouth a little tender. The wagyu gyozas were good but underwhelming. They tasted similar to dumplings you can find anywhere and didn’t have the special richness I expected from wagyu.\nThe rock shrimp in creamy spicy sauce, however, were excellent. The shrimp were tender and coated in a sauce that had a great balance of creaminess and heat. The portion size was surprisingly generous compared to several of the other dishes, which felt on the smaller side.\nWe also ordered the chef’s recommendation of the night, a plate featuring twelve different pieces of sushi. Most of the pieces were very fresh and well prepared. A few had a slightly fishy taste that wasn’t my favorite, but overall it was an enjoyable selection and beautifully presented. Lastly I had dessert, it was super yummy! Forgot the name though..\nIn general, the food at Nobu is very good and the presentation is truly exceptional. My only hesitation is the pricing. Several of the portions feel quite small for the cost, and some dishes didn’t feel distinctive enough to justify the premium price tag. Still, the overall experience was memorable and worth trying at least once, especially if you appreciate refined Japanese cuisine with creative touches. We were a party of two and paid around $500.",
    "review_rating": 4,
    "review_author": "Omimuri",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.85
  },
  {
    "restaurant_name": "Nobu Fifty Seven",
    "city": "New York City",
    "place_id": "ChIJPX5iCfpYwokRACnACAf2pJw",
    "review_text": "Finally had the chance to try Nobu Fifty Seven and it lived up to the hype. We ordered the Yellowtail Jalapeño, Crispy Rice with Spicy Tuna, House Special Roll, Shrimp Tempura Roll, and Spicy Tuna Roll. Every dish was fresh and full of flavor. I had been wanting to try the Crispy Rice with Spicy Tuna for ages, and it absolutely did not disappoint!\n\nWe paired our dinner with two espresso martinis since we had a long night ahead. They were smooth and exactly what we wanted.\n\nMy only minor complaint was the table we were seated at had an overhead light tilted directly toward my face. It was much brighter than the rest of the room and a little distracting, especially since most of the restaurant had an intimate vibe.\n\nOverall, Nobu Fifty Seven was a great experience. The food and drinks were excellent and I would definitely come back to try more.",
    "review_rating": 5,
    "review_author": "Kelsey Clark",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Nobu Fifty Seven",
    "city": "New York City",
    "place_id": "ChIJPX5iCfpYwokRACnACAf2pJw",
    "review_text": "Fantastic, my wife and I had dinner here for her birthday\nNeeded to schedule a few weeks in advance\nThe food was really great, we ordered variety of dishes and all were excellent!\nThe service is good, kind and helpful\nTook two cocktails and a desert too\nTha place is beautiful\nVery expensive though..\nI recommend this place\n............................................................................................................................................",
    "review_rating": 5,
    "review_author": "Dror Picherski",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Marea",
    "city": "New York City",
    "place_id": "ChIJvWSDS_ZYwokRiG9D395loxo",
    "review_text": "We came on Christmas Eve and it was extremely crowded. The restaurant previously held a Michelin star, and after this visit, I can see why it might have lost it. Perhaps it was due to the holiday rush, but the service that night was fairly mediocre.\n\nWe ordered the white truffle pasta, $110 for 4g. While the presentation was fine, it definitely did not feel Michelin-level. The risotto was more enjoyable than the tagliatelle and had a much richer flavor.\n\nFor the starter, the Cannolicchio was quite creative, and the Astice was excellent!! The lobster was very bouncy, fresh, and sweet, and the burrata was rich and milky. Unfortunately, the Ricci was a big disappointment; the uni had a strong fishy taste and the quality was poor.\n\nFor the primi, we tried the Capellini, which I was really excited about but ended up disappointed. It was overly acidic, and the butter was not well incorporated. We also ordered half portions of the Pappardelle Granchio Reale and Fusilli, and surprisingly, these simpler pasta dishes were more enjoyable than the so-called signature ones.\n\nFor the main course, we chose the Anatra. It was already portioned when served, and the duck skin was beautifully crispy, one of the best dishes of the night.\n\nWe ordered two desserts and both were very good; I especially liked the tiramisu.\n\nOverall, the portions here are quite generous. Some shortcomings help explain the lost star, but I would still recommend coming when it’s less crowded.",
    "review_rating": 5,
    "review_author": "VICTORIA C",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Marea",
    "city": "New York City",
    "place_id": "ChIJvWSDS_ZYwokRiG9D395loxo",
    "review_text": "We had an extremely disappointing experience here as a group of four. Our bill was almost $900 including bottles of wine, so this was not a casual or low-spend visit.\n\nDespite that, we were made to feel unwelcome towards the end of the evening. Staff began clearing our table without asking or receiving permission, while we were still seated. Shortly after, we were explicitly asked to leave because we had “overstayed,” even though no time limit had been communicated in advance. Also, they took forever to take our orders.\n\nIf there is a strict seating policy, it should be made clear upfront — not enforced abruptly and rudely after guests have spent a significant amount of money. The way this was handled felt disrespectful. Being the only four brown people at the restaurant it totally felt discriminatory.\n\nFor a restaurant positioning itself at this price point, the service and hospitality fell far below expectations. We won’t be returning and would not recommend this place to others looking for a welcoming dining experience. We did bring this up to the management and they seemed more interested in getting the credit card charged right away and did not offer any significant apologies. Our server ( Robert) was actually nice but his service could not make up for how the evening turned out overall.",
    "review_rating": 1,
    "review_author": "Jasjit Khurana",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Marea",
    "city": "New York City",
    "place_id": "ChIJvWSDS_ZYwokRiG9D395loxo",
    "review_text": "Elegant dining experience.  Bring your credit cards!\n\nWe just had dinner here. The food was good overall. The main server was good.\n\nThree separate people asked us if we wanted water before someone actually brought us water….\n\nWe ordered the duck for our main course.  The server placed the rare duck in front of the wrong diner, even after we asked about cooking level.\n\nThe food overall is elegant and the wine list expansive.\n\nSort of odd Marea did not offer an amuse bouche or anything else.",
    "review_rating": 3,
    "review_author": "Elizabeth J",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Marea",
    "city": "New York City",
    "place_id": "ChIJvWSDS_ZYwokRiG9D395loxo",
    "review_text": "Marea is a solid place; consistently delightful, albeit pricey. The standout dishes for me were the Bronzino tartar and the tagliatelle (without the truffles). The grilled Bronzino and scallops were okay. I wouldn’t recommend the scampi croquette (though others in my group raved about the sardines).\n\nOur server was wonderful and intuitive as were the other main staff. Some hiccups with the support staff (e.g. repeatedly mixing up still and sparkling water, taking long to clear crumbs off the table, small things like that - but that’s okay). Overall I very much recommend and will be back",
    "review_rating": 4,
    "review_author": "Metty Fisseha",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Marea",
    "city": "New York City",
    "place_id": "ChIJvWSDS_ZYwokRiG9D395loxo",
    "review_text": "Marea completely lived up to the hype. Incredible seafood, flawless execution, and a warm, sophisticated atmosphere. Every bite was memorable, and the service made the experience feel effortless. One of those restaurants you keep thinking about after you leave",
    "review_rating": 5,
    "review_author": "Botakoz Arystanbekova",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "The Capital Grille",
    "city": "New York City",
    "place_id": "ChIJkQQlwvhYwokR1Grog17qfew",
    "review_text": "I visited this restaurant to celebrate my birthday, and everything was wonderful from start to finish. We were welcomed at the table with decorative touches that made the evening feel extra special. The appetizers were delicious, the cocktails were excellent, and the steak was cooked perfectly—we loved it.\nA special thank you to Edgar, who went above and beyond to make our night memorable. We truly appreciate his help and kindness. Highly recommended!",
    "review_rating": 5,
    "review_author": "buse başdemir",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.95
  },
  {
    "restaurant_name": "The Capital Grille",
    "city": "New York City",
    "place_id": "ChIJkQQlwvhYwokR1Grog17qfew",
    "review_text": "We came as walk-ins and were very grateful that we were seated right away. Our server, Maria, was very sweet; however, overall the wait staff was not at the level expected of a fine dining establishment. Their English was quite poor. The service itself was excellent, and thanks to Maria for her food recommendations.\n\nOne thing I would point out is that the hostesses do not seem to have a proper dress code for a place like this—it’s really not appropriate to see a hostess wearing UGG boots and a gray T-shirt.",
    "review_rating": 3,
    "review_author": "Aldina Avdić",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "The Capital Grille",
    "city": "New York City",
    "place_id": "ChIJkQQlwvhYwokR1Grog17qfew",
    "review_text": "Everything was amazing. From food - to drinks - to service - to the thoughtful and delicious dessert they included for my birthday!",
    "review_rating": 5,
    "review_author": "Madison",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "The Capital Grille",
    "city": "New York City",
    "place_id": "ChIJkQQlwvhYwokR1Grog17qfew",
    "review_text": "Looked around places in NYC for a burger and drink at a bar.  The Capital Grill really delivered. Service is so much better, staff friendly & helpful. Bathrooms were really clean and multiple team member asking if we need anything else. Wagyu & Wine was a great deal and glad I stopped by!",
    "review_rating": 5,
    "review_author": "David M",
    "moods": [
      "celebration",
      "work"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "The Capital Grille",
    "city": "New York City",
    "place_id": "ChIJkQQlwvhYwokR1Grog17qfew",
    "review_text": "Started with fresh oysters. Best steak I’ve ever had. Highly recommend the bone in ribeye accompanied Sam’s mashed potatoes and the grilled asparagus and the service was impeccable. Delaney and the rest of the staff elevated the whole experience. Will definitely come back again and tell my friends to come if they ever have the chance",
    "review_rating": 5,
    "review_author": "Brandon Hickey",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.85
  },
  {
    "restaurant_name": "McGee's Pub",
    "city": "New York City",
    "place_id": "ChIJ92Q_APhYwokR0Ct3Oz-9CAE",
    "review_text": "Went jere because of the (loose) connection to the tv show.\nWe didn't book a table and went in on the last Saturday before Christmas, we had to wait about 15 minutes for a table.\nThe service was great and friendly, the food was amazing really tasty and was probably the only homemade style meal we had in New York.\nI felt the overall bill was a little high, but ypu get what you pay for.\nWe all really enjoyed it and would go back again.",
    "review_rating": 5,
    "review_author": "Steve Lazenby",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "McGee's Pub",
    "city": "New York City",
    "place_id": "ChIJ92Q_APhYwokR0Ct3Oz-9CAE",
    "review_text": "My cousin and I came to this pub during out holiday and I can’t rate it high enough! I want to give a special thank you to Joy, Andrew, Allison, Justine and Ciara who made us both feel so welcome, they laughed and joked with us, looked after us extremely well. It was as good a service we could ask for… so we came back every night of our trip! When we came in the second time Joy, one of the bartenders, immediately recognised us and started laughing and having jokes with us right away, and getting us both a beer just as quick! Andrew was also just as brilliant, having jokes with us all night, making sure we both had plenty to drink, and giving us brilliant recommendations off the menu. Allison, Justine and Ciara are also just as amazing, their hard work didn’t go unnoticed to us both and yet again they joined in with the laughing and joking, even teaching us some American jokes!! Some amazing memories have been made here purely down to how excellent the staff are here, I could not recommend it higher",
    "review_rating": 5,
    "review_author": "Bradley Pinion",
    "moods": [
      "celebration",
      "late_night"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "McGee's Pub",
    "city": "New York City",
    "place_id": "ChIJ92Q_APhYwokR0Ct3Oz-9CAE",
    "review_text": "🔟 / 🔟\n\nHello, we have been here 3 times.\n\nI am always amazed by this beautiful and idyllic bar.\n\nThere is delicious food and drinks of all kinds here.\n\nI'm a huge fan of \"How I Met your Mother\" and that's why this bar is a must on every New York trip.\n\nI love this fantastic atmosphere.\n\nIt always feels good to be here, where the idea for 'How I Met your Mother' came from.\n\nYou can be sure that you can expect first-class service here, very friendly and accommodating.\n\nGood price-performance ratio.\n\nBe sure to come here, it's worth it every time.\n\nThat wasn't the last time we were here.\n\nWe will definitely be coming back 100%.\n\nHighly recommended.\n\nUntil next time and have fun here.\n\n✌🏻✌🏻✌🏻",
    "review_rating": 5,
    "review_author": "Team Shadowclaw",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "McGee's Pub",
    "city": "New York City",
    "place_id": "ChIJ92Q_APhYwokR0Ct3Oz-9CAE",
    "review_text": "I’m a huge fan of How I Met Your Mother, and I had been wanting to come to this place for a long time. I absolutely loved the experience. The drinks were delicious, and the bartender was very attentive. There was no waiting time since I sat at the bar. The atmosphere was warm and welcoming.",
    "review_rating": 5,
    "review_author": "Natalie E. Ulloa",
    "moods": [
      "date"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "McGee's Pub",
    "city": "New York City",
    "place_id": "ChIJ92Q_APhYwokR0Ct3Oz-9CAE",
    "review_text": "you’re a big fan of How I Met Your Mother, you have to check out this experience. You totally feel the McLaren’s vibe! You HAVE to try the special drinks from the show. I tried the Robin Sparkles and it gave me sparkles at the end 😝",
    "review_rating": 5,
    "review_author": "Fortuna Cohen",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Dave & Buster's New York City - Times Square",
    "city": "New York City",
    "place_id": "ChIJ8VOfr1RYwokRdgk5I-NvtfE",
    "review_text": "My friends and I got Richard as a waiter and he was very helpful with food options. Him and his coworker were nice enough to give us a free dessert. It was a pleasure.",
    "review_rating": 5,
    "review_author": "Angelica Olazagasti",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Dave & Buster's New York City - Times Square",
    "city": "New York City",
    "place_id": "ChIJ8VOfr1RYwokRdgk5I-NvtfE",
    "review_text": "Booked here to catch up with friends and grab some lunch before heading to the airport. This dinner had a great selection of drinks and hearty classics at good value. Would recommend the burgers and golden fingers. Great service from the staff with recommendations that we tried and enjoyed.",
    "review_rating": 5,
    "review_author": "Ian McCutcheon",
    "moods": [
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Dave & Buster's New York City - Times Square",
    "city": "New York City",
    "place_id": "ChIJ8VOfr1RYwokRdgk5I-NvtfE",
    "review_text": "A great place for $5.00 happy hour daily from 4:30 to 7:00 pm daily for five different type of  drinks from a 22 ounce light beer to Long Island iced tea.\n\nThe floor area adjacent to the restaurant is for those who love to play a large variety of games for all adults and children.\n\nI would have liked to see appetizers added to happy hour instead of filling in a receipt survey on the back of your bill payment.\n\nThis will get you a free $20.00 appetizer with purchase of a main menu item when you return.",
    "review_rating": 5,
    "review_author": "Whistler Ski Bum",
    "moods": [
      "budget",
      "family",
      "late_night"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Dave & Buster's New York City - Times Square",
    "city": "New York City",
    "place_id": "ChIJ8VOfr1RYwokRdgk5I-NvtfE",
    "review_text": "We booked a table to watch the UFC fights on Saturday night. They have plenty of TVs. When we arrived, they sat us in front of one that wasn’t currently showing what we came for, and it took them 20-ish minutes to switch it over. By the time the main fights were on, almost every TV was playing UFC. Service was great. Food was okay. Of the two finger foods we ordered (Philly egg rolls and boneless wings), they were mildly overcooked, dry, and overpriced. You’re paying for the space, not the food.",
    "review_rating": 4,
    "review_author": "Rachel Barnard",
    "moods": [
      "late_night",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Dave & Buster's New York City - Times Square",
    "city": "New York City",
    "place_id": "ChIJ8VOfr1RYwokRdgk5I-NvtfE",
    "review_text": "Food is pretty good at this location. D&B sometimes has some good promotions going on like $5 Margs and $10 wings. Sundays and Wednesdays (I believe) games are half off.",
    "review_rating": 4,
    "review_author": "Kimberly Rodriguez",
    "moods": [
      "budget",
      "late_night"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Ai Fiori",
    "city": "New York City",
    "place_id": "ChIJMYIE-KlZwokRZuFHn8jkNuo",
    "review_text": "Went for Restaurant Week ($60 per person). The food and drinks were incredible. Three course meal of the most delicious food. Well prepared and beautiful. The restaurant was gorgeous and the service was great. I would love to come back here again. The highlight for me was the Butternut Squash Soup. It was so good! The portion sizes were perfect for me.",
    "review_rating": 5,
    "review_author": "Caroline Montana",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.85
  },
  {
    "restaurant_name": "Ai Fiori",
    "city": "New York City",
    "place_id": "ChIJMYIE-KlZwokRZuFHn8jkNuo",
    "review_text": "Absolutely loved our experience at Ai Fiori. The flower decorations and overall ambiance are beautiful, elegant, warm, and inviting. The food was outstanding: the lobster bisque was rich and flavorful, and both the Maine lobster and the ink squid dishes were absolutely delicious. Even the coffee was excellent.\n\nSpecial shoutout to Ismail, our server, who provided exceptional service, attentive, warm, and professional. Everyone we encountered was friendly, and the hospitality was truly top-notch. A wonderful dining experience from start to finish. Highly recommend.",
    "review_rating": 5,
    "review_author": "David Lee",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Ai Fiori",
    "city": "New York City",
    "place_id": "ChIJMYIE-KlZwokRZuFHn8jkNuo",
    "review_text": "Located inside the hotel, Ai Fiori is a great spot for business lunch or dinner.\nFrom the ambience to service to food, it was excellent!\nLobster bisque was rich and tasty. Tuna tartar was beautifully presented and all the ingredients were harmonious.\nPasta was cooked perfectly and kept the temperature until the last bite.\nService was efficient and our waiter went above and beyond.\nWhen you are in the city, definitely visit Ai Fiori.",
    "review_rating": 5,
    "review_author": "Amy Kang",
    "moods": [
      "work",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Ai Fiori",
    "city": "New York City",
    "place_id": "ChIJMYIE-KlZwokRZuFHn8jkNuo",
    "review_text": "Excellent choice for a business dinner. Ai Fiori delivers a refined dining experience with exceptional service, elegant ambiance, and perfectly executed dishes. The setting allows for great conversation without noise, and the staff strikes the right balance of professionalism and warmth. Ideal spot to impress clients or host an executive meal in NYC. 🍷🍽️",
    "review_rating": 5,
    "review_author": "Miguel Hernández y López",
    "moods": [
      "work",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Ai Fiori",
    "city": "New York City",
    "place_id": "ChIJMYIE-KlZwokRZuFHn8jkNuo",
    "review_text": "Where do I even start? First of all, the service was amazing. Our server was so unbelievably kind and gave amazing suggestions on what we should get. All her recs were spot on!! Second of all - the food. Wow. I got the Passera E Caviale which apparently has been on the menu for the past 10 years. I hope it stays on the menu for another 10 years. So flavorful, light, perfect - I’ll never forget that first bite. I also got the spaghetti and duck, both were cooked to perfection. The duck especially was very juicy and tender. No complaints!! I highly recommend!!",
    "review_rating": 5,
    "review_author": "Phoebe Brewer",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Becco",
    "city": "New York City",
    "place_id": "ChIJndGJ5FNYwokRricJvhT0t1s",
    "review_text": "A bit pricey but good.. also good atmosphere..we sat upstairs..I had NY Strip with mushrooms and fries which was enjoyable.   Calamari appetizer was very good as well.. also large choice of bottled wine for $45 flat, which is not too bad for NYC",
    "review_rating": 4,
    "review_author": "John Varga",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Becco",
    "city": "New York City",
    "place_id": "ChIJndGJ5FNYwokRricJvhT0t1s",
    "review_text": "Had the most amazing dinner, felt like we were back in Italy. Service is excellent and prompt. Our waiter was superb. Not to mention the food! Veal piccata, chicken Parm, and incredible pastas !!! If you are in NYC go hungry and enjoy! This classic old school recipes that do not disappoint!",
    "review_rating": 5,
    "review_author": "Honey Gorny",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Becco",
    "city": "New York City",
    "place_id": "ChIJndGJ5FNYwokRricJvhT0t1s",
    "review_text": "Amazing restaurant. Called to reserve two hours before and they were able to accommodate us. Great service, great food!! Love the all you can eat pasta!! It’s $36.95 for a caesar salad or vegetables, and all you can eat 3 types of pastas!!! Definitely will go back!! Delicious!!",
    "review_rating": 5,
    "review_author": "Charlotte Bodart",
    "moods": [
      "celebration",
      "budget"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Becco",
    "city": "New York City",
    "place_id": "ChIJndGJ5FNYwokRricJvhT0t1s",
    "review_text": "Wonderful, authentic experience.  Food was great! I was there with my coworkers after a conference.  We had enough space for 15 at our long table and the room was quiet enough for us all to talk.  Definitely a place to come back too if opportunity comes up.",
    "review_rating": 5,
    "review_author": "Ivan Nekrasov",
    "moods": [
      "work"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Becco",
    "city": "New York City",
    "place_id": "ChIJndGJ5FNYwokRricJvhT0t1s",
    "review_text": "It was good, just nothing exceptional. The salmon was perfectly cooked, the calamari and Caesar salad was very tasty. The brussel sprouts under the salmon were mushy. The pumpkin soup needed salt and the baked pumpkin chips they give on the side turned mushy after a minute. It was the holiday season so  very crowded, very busy. The server was meh. The vibe was, he would have been much happier if I had been spending $100 more which is funny because he forgot to bring the wine. At least it wasn't on the bill.",
    "review_rating": 4,
    "review_author": "Marion Schmidt",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Del Frisco's Grille",
    "city": "New York City",
    "place_id": "ChIJ55dWS_lYwokRDVs8xyL3uDo",
    "review_text": "This is a great casual spot for drinks after work. They have a “girl dinner” special rn for $25 fries, salad, pasta and a drink. Great deal amazing service by Aaron as well. Will definitely be coming back.",
    "review_rating": 5,
    "review_author": "Taylor Mcknight",
    "moods": [
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Del Frisco's Grille",
    "city": "New York City",
    "place_id": "ChIJ55dWS_lYwokRDVs8xyL3uDo",
    "review_text": "Nothing more convenient than seeing the Rockefeller Christmas Tree and walking a block away to this fabulous restaurant. The place was decorated just beautifully. The 4 of us each had steak for dinner. My friend and I had the Prime Rib steak cooked to perfection and LOVED the tasty rub on it. Of the other couple one had Short Ribs and the other had Petite Filet Mignon.  They said it was EXCELLENT as well ! We ordered a couple of “sides” to share and shared a fabulous Cookie Crumble Sundae that was out of this world. We all loved the whole experience being at DelFrisco’s!!",
    "review_rating": 5,
    "review_author": "Mary Jean Kerr",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Del Frisco's Grille",
    "city": "New York City",
    "place_id": "ChIJ55dWS_lYwokRDVs8xyL3uDo",
    "review_text": "Yesterday my partner and i went to Del Frisco's for dinner. Immediately met with the hostess who was extremely pleasant. We were seated immediately. Our waiter, forgot his name, was really nice and patient. He checked up on us  consistently but not overbearing. The manager, Marcus, also stopped by our table to check in, and we had a small chat about the snowstorm that was hidden NYC the next day. You can tell that he cared about the restaurants customers by the way he spoke. The food was excellent, especially the cheesesteak eggrolls. We were celebrating an anniversary and we were bought a cheesecake, two shots.,  and a lovely card. This was a memory that will always remain. Thank you Del Frisco's for a wonderful experience. We will be back in the near future.",
    "review_rating": 5,
    "review_author": "Bellencyta White",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.95
  },
  {
    "restaurant_name": "Del Frisco's Grille",
    "city": "New York City",
    "place_id": "ChIJ55dWS_lYwokRDVs8xyL3uDo",
    "review_text": "This was a 7/10, came here for my brothers bday, there was like almost no space to walk by the seats were literally not even an inch apart of another persons seat.. but then again we went during peak hours so I can’t complain. The food was also mid. I would recommend for drinks.",
    "review_rating": 4,
    "review_author": "jojo",
    "moods": [
      "celebration",
      "budget"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Del Frisco's Grille",
    "city": "New York City",
    "place_id": "ChIJ55dWS_lYwokRDVs8xyL3uDo",
    "review_text": "Went for Thanksgiving dinner. It was fine. Plate could've been larger for the cost, but the cuisine was pretty standard. Ambiance was nice. I was seated in a quieter corner, which I appreciated. Server was also fine, though I waited 10-15 minutes to pay once I had the check. Nothing remarkable in the positive or negative.",
    "review_rating": 4,
    "review_author": "Alex Lanpher",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Eleven Madison Park",
    "city": "New York City",
    "place_id": "ChIJEWbXz6ZZwokRLKmKrtPfVFY",
    "review_text": "⭐️⭐️⭐️⭐️⭐️\nAn unforgettable dining experience at Eleven Madison Park!\n\nFrom the moment I walked in, everything felt meticulously crafted — elegant yet welcoming. The service was beyond exceptional: attentive, warm, and incredibly knowledgeable. Every course was a piece of art, balancing creativity with flavor in a way that only Eleven Madison Park can achieve.\n\nWhat impressed me most was the restaurant’s commitment to plant-based cuisine without sacrificing luxury or depth. Each dish told a story — from the delicate textures to the thoughtful plating — and the flavors were bold, surprising, and deeply satisfying. The wine pairings elevated the experience even further.\n\nThe atmosphere is serene and sophisticated, with every detail designed to enhance the meal. By the end of the evening, it didn’t feel like just dinner; it felt like being part of a masterpiece.\n\nA particularly memorable highlight was being personally invited into the kitchen — an extraordinary gesture that offered a glimpse into the artistry and discipline behind each creation. The team’s professionalism and passion were unmistakable, making the experience even more inspiring.\n\nIf you’re looking for an experience that’s both inspiring and indulgent, Eleven Madison Park is truly one of the world’s finest.",
    "review_rating": 5,
    "review_author": "Antonio On The Map",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Eleven Madison Park",
    "city": "New York City",
    "place_id": "ChIJEWbXz6ZZwokRLKmKrtPfVFY",
    "review_text": "EMP has been on my bucket list for a long time. When I found out they were featuring meat courses again, I was ecstatic because we happen to be in town. I was lucky enough to grab one of their bar tasting menu reservations. We’ve had the privilege to dine at many Worlds Best and Michelin starred restaurants around the world, so I had extremely high hopes.\n\nThe courses were good, but nothing really wowed me. I wish they offered less vegan courses. Since we do not drink alcohol, I was surprised to see a non-alcoholic wine pairing. I opted for it ($135) bc I was intrigued, but I would not get it again. The white pairings were delicious, but the red pairings all tasted sour and left a bad aftertaste. I only had a sip. Service was exceptional, I did not expect anything less. For the price, I would rather go to Per Se or Le Bernardin.",
    "review_rating": 4,
    "review_author": "Caitlin Abelman",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Eleven Madison Park",
    "city": "New York City",
    "place_id": "ChIJEWbXz6ZZwokRLKmKrtPfVFY",
    "review_text": "Came here for a birthday celebration!\nIt was amazing! The staff was so on point, I didn’t even know when they were refilling my glass with water.\nSo happy there is Meat on the menu again!\n\nThe team was great, they work so well together. It was an army there!\n\nA shout out to Brandon. And the staff member that heard me when I said “oh I would love another one of those” then there it was another one!\n\nWe will be back for the next menu",
    "review_rating": 5,
    "review_author": "Daniel Chen",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Eleven Madison Park",
    "city": "New York City",
    "place_id": "ChIJEWbXz6ZZwokRLKmKrtPfVFY",
    "review_text": "It makes me sad to share that I had an underwhelming experience here last night. I dined at Eleven Madison Park with high expectations, and unfortunately the experience fell short of what a restaurant of this reputation should deliver. This visit was especially meaningful, as it was both my birthday and New Year’s Eve, and EMP has long been my number one must-try restaurant in the world.\n\nI’ve worked in the service industry for a decade and have read Unreasonable Hospitality multiple times. I truly admire the philosophy behind this book, which made this experience even more disappointing.\n\nFrom the beginning, we felt rushed. We were hurried over to our table 20 minutes before our reservation when we had hoped for a drink at the upstairs bar first. Our table was shoved in a corner and was lacking white table cloths/more elegant settings since we were seated at a bar table. The first course arrived before our cocktails, which threw off the pacing of the meal and felt very rushed.\n\nOne particularly surprising moment was when my soup was poured into my water glass instead of the proper vessel. I was sad that more soup was not brought to replenish my serving as it was delicious, but I feel I missed about a quarter of the serving from the faux pas.\n\nI was very disappointed that the duck was removed from the tasting menu for the night as this was a course I have been fantasizing about trying for over a year. I was excited it was supposed to be back now that the restaurant is no longer vegan.\n\nDessert arrived frozen solid, we could not break into it. My date’s dessert went flying off his plate from his effort to cut into it, so it had to be replaced. While mistakes can happen anywhere, experiencing this many issues at a restaurant that holds three Michelin stars was genuinely underwhelming.\n\nWhat stood out most was the service overall. The servers felt over-rehearsed and burnt out, like they were just going through the motions rather than offering genuine hospitality. I believe this is why so many mistakes were made. My date remarked that the staff felt very green, but my feeling was that holiday burn out was wearing everyone thin.\n\nAt this price point, and at a three-Michelin-star level, the experience should feel thoughtful, seamless, and warm. Instead, it felt rushed and mechanical, lacking the care and attention to detail that make a meal truly special. I am hopeful that these rare mistakes can be addressed and corrected for future diners to better enjoy the experience I had anticipated for so long.",
    "review_rating": 2,
    "review_author": "Claire Gautreaux",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Eleven Madison Park",
    "city": "New York City",
    "place_id": "ChIJEWbXz6ZZwokRLKmKrtPfVFY",
    "review_text": "Incredible incredible incredible evening. Best Dinner in a decade. Went here for my 5th wedding anniversary and my wife and I were floored by all the surprise and delights. We had both read “unreasonable hospitality”, so we were familiar with the vision of the space. but it blew away every expectation we had. Huge thanks to our amazing server Kalem Scott, Marina our greeter and Chloe our Kitchen Tour guide that showed us behind the scenes. Book a reservation here as soon as you can. They pull out all the stops. We even got to meet Chef Daniel Humm.",
    "review_rating": 5,
    "review_author": "Joel Hansen",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.95
  },
  {
    "restaurant_name": "Gramercy Tavern",
    "city": "New York City",
    "place_id": "ChIJvSQIgqFZwokRFYQbJdzceSs",
    "review_text": "Really lovely place to dine! Food is delicious and staff is amazing. Host staff is one of the best in the city! The burger is divine, but don’t miss out on the seasonal pastas either! And you can’t miss the chocolate chip cookie with milk. They have a coat check as well which is really nice.\n\nWould definitely recommend you have a reservation or look for seating at the bar.",
    "review_rating": 5,
    "review_author": "Samantha C",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Gramercy Tavern",
    "city": "New York City",
    "place_id": "ChIJvSQIgqFZwokRFYQbJdzceSs",
    "review_text": "Excellent dinner from start to finish.\nThe seasonal menu was thoughtful and well executed, with great balance and high-quality ingredients. The lamb main was cooked perfectly and full of flavor, and the overall pacing of the meal felt just right. Desserts were refined and not overly sweet. Professional service and a relaxed, elegant atmosphere. Would definitely return.",
    "review_rating": 5,
    "review_author": "Tzvika Mizrahi",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.85
  },
  {
    "restaurant_name": "Gramercy Tavern",
    "city": "New York City",
    "place_id": "ChIJvSQIgqFZwokRFYQbJdzceSs",
    "review_text": "From start to finish, this was the best dining experience my now wife and I have ever had. We’re on our honeymoon, and having each worked over a decade in hospitality, this being our first Michelin-star experience set the bar impossibly high.Our server Michael was exceptional—warm, personable, and spot-on with both dinner and drink recommendations and suggestions for a perfect nightcap afterward. Luka paired wines beautifully with our mid course and mains, elevating each course effortlessly. Chef Michael even came out to chat with us about the industry and mutual connections back home, and surprised us with a lobster and truffle bite that was nothing short of incredible.Every single dish was sublime. The dirty martini (with pickle brine) was the best we’ve ever had. Even their simple red pepper and cashew starter was just shockingly good, and the seafood platter was absolutely worth it. From the yellowtail to the gnocchi and squid ink caramelle, every course hit. The pork loin and belly and the sirloin were both outstanding. Dessert sealed the night—the cherry chocolate dessert, followed by little chocolates to finish with a hummingbird cake. They even sent us off with something special to enjoy the next morning, which we can’t wait to enjoy.Flawless hospitality, thoughtful touches, and unforgettable food. An experience we’ll remember for the rest of our lives.",
    "review_rating": 5,
    "review_author": "Tim Cheek",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.95
  },
  {
    "restaurant_name": "Gramercy Tavern",
    "city": "New York City",
    "place_id": "ChIJvSQIgqFZwokRFYQbJdzceSs",
    "review_text": "“One of the best burgers in NYC — easily.”\nBoth my wife and I ordered the burger and we were extremely happy with it. It comes with an aioli sauce that makes the whole combination absolutely unmatched. Juicy, flavorful, and perfectly put together.\n\nThe restaurant itself is beautiful and has a great atmosphere. It’s really hard to get a reservation, but you can walk in and sit at the bar — we waited about 30 minutes for a spot. The staff was very friendly and welcoming.\n\nWe had a wonderful experience and will definitely be coming back.",
    "review_rating": 5,
    "review_author": "Antonio Madrazo Ibarra",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Gramercy Tavern",
    "city": "New York City",
    "place_id": "ChIJvSQIgqFZwokRFYQbJdzceSs",
    "review_text": "We had lunch at Gramercy Tavern on Sunday with a group of four, seated in the Tavern area rather than the formal dining room. The cocktails were a fantastic start—absolutely 5 out of 5. The staff was warm and attentive, and the atmosphere was lively and welcoming.\n\nThe flatbread was excellent, one of the highlights of the meal. But overall, I was hoping for a bit more from the rest of the food. We tried the burger, pork shoulder, swordfish, tomato salad, and liver mousse. While some dishes were fine, the burger and pork shoulder in particular were disappointing and just didn’t hit the mark. The salad and mousse also felt a little ordinary.\n\nFor a place with such a strong reputation—and at this price point—I expected the dishes to shine more. Still, the service and vibe were wonderful, which made the experience enjoyable overall.\n\nIf I had to rate it: 5 stars for service and ambiance, but about 3 stars for the food, so overall a solid 3 stars.",
    "review_rating": 3,
    "review_author": "Karl Kwon",
    "moods": [
      "work",
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "The Lambs Club",
    "city": "New York City",
    "place_id": "ChIJu0soFVVYwokRArPqt2VGdJs",
    "review_text": "My wife and I had an absolutely wonderful breakfast at The Lambs Club. From start to finish, the experience was flawless. The service was top notch — the staff were warm, attentive, and made sure everything was perfect without ever being intrusive. The food was incredibly fresh, beautifully presented, and full of flavor. The coffee was strong and perfectly brewed, just the way a morning should start.\n\nThe atmosphere truly sets The Lambs Club apart — from the elegant furniture to the historic photos on the walls, every detail exudes character and sophistication. You can feel the rich history of the place paired seamlessly with genuine hospitality.\n\nA perfect breakfast experience in every way — highly recommend to anyone looking for a memorable and refined start to their day.",
    "review_rating": 5,
    "review_author": "Igor Lyutin",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "The Lambs Club",
    "city": "New York City",
    "place_id": "ChIJu0soFVVYwokRArPqt2VGdJs",
    "review_text": "Our reservation was at 7pm and was able to get seat on time. The staff were friendly and helpful. Once we ordered, food came in decent time. The duck was tender and melts in your mouth. The scallops were delicious but too creamy for my taste. Otherwise we enjoyed the food and experience.",
    "review_rating": 5,
    "review_author": "Christine S.",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "The Lambs Club",
    "city": "New York City",
    "place_id": "ChIJu0soFVVYwokRArPqt2VGdJs",
    "review_text": "Great spot for dinner before a show. They are very thoughtful on timing and service is impeccable. Food is prefix and tasty but not extraordinary. Still very good experience near broadway",
    "review_rating": 4,
    "review_author": "O M",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "The Lambs Club",
    "city": "New York City",
    "place_id": "ChIJu0soFVVYwokRArPqt2VGdJs",
    "review_text": "Absolutely delightful dinner at the Lambs Club NYC 🥰\nThe lamb (as expected) was exquisite. I also had the steak tartar with caviar. I have not had caviar in a while, so that was such a treat! 🥰\n\nSpecial thanks to Lydia who has been very attentive and accommodating. Definitely a five-star experience!",
    "review_rating": 5,
    "review_author": "Louie Mar Gangcuangco",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "The Lambs Club",
    "city": "New York City",
    "place_id": "ChIJu0soFVVYwokRArPqt2VGdJs",
    "review_text": "This restaurant felt like a sexy scene out of a movie, or something you’d experience in Palm Springs. The fireplace is inviting, the leather “diner” seating felt luxurious not campy, and overall the restaurant was quiet enough to have a conversation without shouting (on a Wednesday night at 8 pm). The service made me feel like a celebrity and the food was impeccable. 10/10!",
    "review_rating": 5,
    "review_author": "Jeff Koo",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Green Symphony",
    "city": "New York City",
    "place_id": "ChIJ1VR_m1RYwokRGqUM_C_WSZc",
    "review_text": "Tiny but mighty! You can tell the owner knows what he is doing. If I remember correctly, the guy there is the son of the former owner. My second visit was today and it didn’t disappoint! The owner and the staff were very helpful and nice.\n\nI had the Zen Mandu Bowl (totally a Star Wars sounding name-lol). It has all vegetarian steamed potstickers, plenty of veg, kimchi with a lovely sauce; cool and refreshing. I could only eat because I also had a delicious shake made out beets and other yummy things ($9.25). So refreshing! Prices at pretty typical for NYC and so many options.\n\nThey also have a few hot and cold chicken and turkey options today. Wraps and Turkey meatballs…looked delicious but I wanted fresh vegetables. They also have veggie friendly cookies, chips, Ollipop, and other things.\n\nThey also had lentil soup, chicken soup and I forget what the third soup was. My friend had the chicken soup.\n\nSadly, the lovely sorbetto that was here earlier in the year! Next time , I’ll have to ask about it!",
    "review_rating": 5,
    "review_author": "Alison Jackson",
    "moods": [
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Green Symphony",
    "city": "New York City",
    "place_id": "ChIJ1VR_m1RYwokRGqUM_C_WSZc",
    "review_text": "Food felt a little small, but it was a good price! Love to see so many vegan options along with normal food. Plus it had a cute interior and some phantom of the opera pictures! For Times Square, this is a good stop for healthy food",
    "review_rating": 4,
    "review_author": "Ella Holzhei",
    "moods": [
      "budget",
      "quick_bite"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Green Symphony",
    "city": "New York City",
    "place_id": "ChIJ1VR_m1RYwokRGqUM_C_WSZc",
    "review_text": "What a great find!!!! So nice to find a place with so many vegan options. I wanted to try it all! Service and friendly staff were exceptional and the food incredibly delicious. Wait time was minimal with a small seating area. Perfect to order and go or stay in to munch. Prices were reasonable. Seriously, you won't be disappointed. This has been added to one of our favorite NYC spots to grab something healthy and tasty on the go. Wish we had found it sooner. Will definitely be back!",
    "review_rating": 5,
    "review_author": "patty hedges",
    "moods": [
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Green Symphony",
    "city": "New York City",
    "place_id": "ChIJ1VR_m1RYwokRGqUM_C_WSZc",
    "review_text": "A friend said this was his favorite place for healthy food and it didn’t disappoint!  I had the Protein Açaí bowl with almond butter, delicious!  Sad to hear that this spot is closing down.",
    "review_rating": 5,
    "review_author": "Untruth",
    "moods": [
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Green Symphony",
    "city": "New York City",
    "place_id": "ChIJ1VR_m1RYwokRGqUM_C_WSZc",
    "review_text": "Lots of really tasty looking vegetarian options! I went with the yummy vegetarian wrap and I'm happy to say that it was actually delicious! However, it kind of fell apart while I was eating it - the wrap wasn't strong enough to hold the contents without tearing. Would definitely still order again, though! Just letting you know that it can be a bit of a messy dining experience.\n\nThe staff was very friendly and helpful! They made recommendations, which I always love to hear.\n\nTip: They have a limited seating area! So if you show up during lunch hours, plan to take your food with you. They can probably seat up to 12 people in their seating area.",
    "review_rating": 4,
    "review_author": "Vega Taylor",
    "moods": [
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Trattoria Trecolori",
    "city": "New York City",
    "place_id": "ChIJYepwLVRYwokRsvXclA3XFqo",
    "review_text": "A true find and an easy walk from nearby hotels. We shared the tomato caprese and I Rigatoni (chicken, sausage and pasta in a cream sauce). The tiramisu and mini canoli were great! Service was very good. Prices are reasonable.",
    "review_rating": 5,
    "review_author": "onthegoboomer",
    "moods": [
      "date",
      "budget"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Trattoria Trecolori",
    "city": "New York City",
    "place_id": "ChIJYepwLVRYwokRsvXclA3XFqo",
    "review_text": "I am such a hard sell!! But they exceeded expectations. You have to be careful because in time square you can get non sense resturants. I really enjoyed the food and our service.\n\nSERVICE:  Pedro is a fun server and really good at his job. He had a really nice way of adapting to the personalities of each each table. Yes I am nosey so I noticed.\n\nFOOD: The claims were good, just a little fishy for my mood but my partner really like it. We shared the Alfredo and the noddles taste like they are in hous home made and the sauce too. We ordered extra chicken too. The portion is a single size portion so you can eat it alone. I nust wanted less food yesterday.\n\nAMBIENCE: the only thing is the christmas garlins slipped down behind us, but the place is cute quaint and inviting.\n\nThank you, I am a new yorker that left a while ago, so it was nice to come home and have this gem",
    "review_rating": 5,
    "review_author": "BoujeeArtist Chronicles",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Trattoria Trecolori",
    "city": "New York City",
    "place_id": "ChIJYepwLVRYwokRsvXclA3XFqo",
    "review_text": "A very cozy restaurant! The atmosphere is lovely and the wait staff are very knowledgeable. The prices are incredibly fair considering you’re in the heart of the theatre district. I believe the carpaccio was $18, and our pasta dishes were $25-35 each. I would definitely come back! The squid ink pasta was incredible 10/10!!",
    "review_rating": 4,
    "review_author": "Kristiana Simon",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Trattoria Trecolori",
    "city": "New York City",
    "place_id": "ChIJYepwLVRYwokRsvXclA3XFqo",
    "review_text": "Probably worth booking especially at a weekend.\nIt was very busy.\nThe chap on reception was doing an incredible job. We were told the wait would be 30 minutes and received a call to say our table was ready.\nWe were seated upstairs which was larger than I expected. I personally would not have liked Downstairs seating as there were people waiting everywhere inside for a table, perfect if you like people watching tho!!\nThe meal was delicious,  we had breadsticks to start, two each, then a salad and then the main. Mine was chicken plus spaghetti on the side, huge. Portion sizes are so generous in New York,  we could easily share a meal.\nI couldn't fault the service.\nWe even had a wonderful view of the Christmas huts from our table.\nI would throughly recommend and book as popular!!",
    "review_rating": 5,
    "review_author": "Kay Stobbart",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Trattoria Trecolori",
    "city": "New York City",
    "place_id": "ChIJYepwLVRYwokRsvXclA3XFqo",
    "review_text": "This Italian spot near Times Square is such a gem! The location is perfect, and the atmosphere makes it a wonderful place to enjoy a meal in the city. The pasta was fresh, homemade, and absolutely delicious—true comfort food. The mozzarella was to die for, rich and creamy, and paired perfectly with the dishes. Even the complimentary bread was fresh and so tasty, I could have eaten a whole basket! The drinks were refreshing and balanced everything out perfectly. A lovely dining experience all around—I can’t wait to go back!",
    "review_rating": 5,
    "review_author": "Briana Harmon",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Wolfgang's Steakhouse - Park Avenue New York City",
    "city": "New York City",
    "place_id": "ChIJy-HVkwdZwokRVUnfPH0oidY",
    "review_text": "Not what we expected. We’ve been to the branch in the Times building and the one downtown. Those restaurants are grand with huge ceilings and are filled with light while the noise easily floats upwards and disappears…this one is nothing like that though the barrel ceilings are nice. The tables are close but not on top of each other at the other branches but the park avenue site seems to have added too many tables and if you have claustrophobia maybe you should avoid. The waiters station was next to our table and a waiter dropped the giant metal peppermill on one of our party. Accidents happen but upon being informed there were no apologies or any change of behavior or environment…it didnt happen again but very nearly did multiple times. The rudeness was prevalent, the bartender serving us drinks while we waited for our table was a piece of work. Upset that we werent going to eat at the bar and provide him with a fatter tip mocked us for asking to see a menu and not using it. The rudeness at Lugers in Brooklyn or the old Durgin Park in Boston was part of the experience and charm…sadly here it was just poor customer service. Our waiters at the table and the hostesses were more than pleasant but the rest probably should not work in the service industry. The food was why we came and the tuna and bacon and bread and sides were all as expected. The steaks however felt more tough and unaged then they should have been. We thought we were eating much cheaper steaks. The presentation was exactly as expected but the quality of all of our steaks felt more Outback than Manhattan steak house. I would love to revisit this review but after spending over $250 per person for this very average meal with less than average service it is unlikely.",
    "review_rating": 3,
    "review_author": "Nilesh Patel",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.6
  },
  {
    "restaurant_name": "Wolfgang's Steakhouse - Park Avenue New York City",
    "city": "New York City",
    "place_id": "ChIJy-HVkwdZwokRVUnfPH0oidY",
    "review_text": "My most favorite restaurant! Steak!!! Tuna is unbelievable! Excellent chopped salad, good bread. Chocolate mousse cake is to die for. But steak is the number 1 reason to come! Excellent professional service, nice pleasant atmosphere. Of course you pay a lot for this experience, but it is worth it! Highly highly recommend this outstanding restaurant!",
    "review_rating": 5,
    "review_author": "Alex Dreytser",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.85
  },
  {
    "restaurant_name": "Wolfgang's Steakhouse - Park Avenue New York City",
    "city": "New York City",
    "place_id": "ChIJy-HVkwdZwokRVUnfPH0oidY",
    "review_text": "Nick was our server and he was wonderful! Very personable and helpful on the menu. My brother and I had a wonderful time. As a former New Yorker I twas nice to come to a place that treates you like a local. Food was delicious as expected. We had ribeye and una tartare and veggie platter. Drinks were solid as well.",
    "review_rating": 5,
    "review_author": "Dorothy Tse",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Wolfgang's Steakhouse - Park Avenue New York City",
    "city": "New York City",
    "place_id": "ChIJy-HVkwdZwokRVUnfPH0oidY",
    "review_text": "We went on Christmas Day and the place was packed. Everything about this restaurant is perfect. From the moment we stepped inside. The service was impeccable. The food was delicious and plentiful. The gorgeous ceilings and decor were stunning. Would recommend if you love steak. Plus it is wheelchair accessible.",
    "review_rating": 5,
    "review_author": "Tee Tat",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Wolfgang's Steakhouse - Park Avenue New York City",
    "city": "New York City",
    "place_id": "ChIJy-HVkwdZwokRVUnfPH0oidY",
    "review_text": "Not very friendly for a solo traveler. Although I had made a reservation for a table, they sat me at the bar. The bar menu was still full price. The bartender was friendly and inviting, but it wasn’t the holiday meal I had envisioned. The bread was cold. My steak was cooked perfectly. No dessert menu was offered. The value was questionable.",
    "review_rating": 2,
    "review_author": "Samantha Lauchlan",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.6
  },
  {
    "restaurant_name": "Birdland Jazz Club",
    "city": "New York City",
    "place_id": "ChIJdc9EhVNYwokR-naSYfm_Urc",
    "review_text": "Sat at the bar for Afro Latin Jazz Orchestra. Wonderful and awesome. Had amaretto coffee drinks and cheesecake bc we had already eaten dinner. Dessert chef is amazing, best cheesecake ive ever had. Very fluffy and delicious. Barkeep said desserts were the shining stars of menu.",
    "review_rating": 5,
    "review_author": "Kelli Reed",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.85
  },
  {
    "restaurant_name": "Birdland Jazz Club",
    "city": "New York City",
    "place_id": "ChIJdc9EhVNYwokR-naSYfm_Urc",
    "review_text": "We had an amazing evening at this jazz club! The atmosphere was vibrant yet cozy, with incredible live music that set the perfect tone for the night. The musicians were extremely talented and kept the crowd entertained from start to finish.\nDinner was just pretty tasty—we had lasagna and Cajun jambalaya. The service was excellent too: friendly, attentive, and made the whole experience seamless.\nIt’s not easy to find a place that combines great food, top-notch live music, and a welcoming vibe, but this spot does it all. Highly recommend for anyone looking for a fun and memorable night out!",
    "review_rating": 5,
    "review_author": "LL0206",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Birdland Jazz Club",
    "city": "New York City",
    "place_id": "ChIJdc9EhVNYwokR-naSYfm_Urc",
    "review_text": "Amazing experience! Saw a big band play. Loved every minute of it! You can order a full dinner while you’re there plus drinks. Huge portions but a bit heavy. But hey, you’re there for the music right? Service was pretty good - coming by between sets.\n\nDefinitely worth making the effort to stop by. Decent bathrooms.",
    "review_rating": 5,
    "review_author": "Graham A",
    "moods": [
      "celebration",
      "late_night"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Birdland Jazz Club",
    "city": "New York City",
    "place_id": "ChIJdc9EhVNYwokR-naSYfm_Urc",
    "review_text": "Such a wonderful place with great vibes and tasty food. The live performance by the drummer, pianist, and double bassist was fantastic!\nI left my clothes there by mistake, and even though they were busy, a kind lady took the time during the performance break to find them for me. I really appreciated her kindness. I’d love to come back again someday.",
    "review_rating": 5,
    "review_author": "이민준",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Birdland Jazz Club",
    "city": "New York City",
    "place_id": "ChIJdc9EhVNYwokR-naSYfm_Urc",
    "review_text": "Amazing experience - strong drinks, friendly service and great music. We didn’t have any food because vegan options were not exciting at all but still had a lovely evening with great cocktails. Would definitely recommend booking this experience in advance and also coming early if you want nice seats!",
    "review_rating": 4,
    "review_author": "Marjolaine G",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "FIG & OLIVE | Fifth Avenue",
    "city": "New York City",
    "place_id": "ChIJZbgM8_tYwokRFnNjm92tco0",
    "review_text": "Had lunch at Fig & Olive for the first time today and was very impressed, I see why this place is packed all of the time as the food is delicious! Had the tuna sandwich in particular, and it was out of this world. The service at the bar was fantastic, too. We'll definitely be returning to Fig & Olive in the near future. Highly recommended!",
    "review_rating": 5,
    "review_author": "A R",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "FIG & OLIVE | Fifth Avenue",
    "city": "New York City",
    "place_id": "ChIJZbgM8_tYwokRFnNjm92tco0",
    "review_text": "5pm starts seating upstairs. They have a few appetizers and small plates and entrees. They are all pretty small so good for one person or get multiple to share. We had a light bite. Beet humus and the lamb & couscous with the fig and olive drink. All was amazing flavors and the right amount of spices.",
    "review_rating": 5,
    "review_author": "Lexi K B",
    "moods": [
      "quick_bite"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "FIG & OLIVE | Fifth Avenue",
    "city": "New York City",
    "place_id": "ChIJZbgM8_tYwokRFnNjm92tco0",
    "review_text": "Great fresh food at this location. Went for birthday Lunch for my daughter and she really enjoyed herself. We had the most amazing waiter in the world. He was so engaging and made us all feel like we alone at the restaurant and he was just giving us too notch service. Kudos! We tried a wide variety of appetizers and entrees and every single one was delicious. The dips are all amazing they are a must try. Definitely recommend if your in the area. I will definitely be coming back to try the dinner menu. Cheers!",
    "review_rating": 5,
    "review_author": "Luis A",
    "moods": [
      "celebration",
      "family"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "FIG & OLIVE | Fifth Avenue",
    "city": "New York City",
    "place_id": "ChIJZbgM8_tYwokRFnNjm92tco0",
    "review_text": "Good Mediterranean Food I had in a while.\n1. Definitely try to truffle croquettes!\nOne of the best croquettes I had\n2. Good ingredients\ntheir olive oil is really fresh and amazing, making their food also amazing.\n3. Wait time was too long\nIt took 40minutes from appetizers plates taken from main dish served.",
    "review_rating": 4,
    "review_author": "Jay Sim",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.6
  },
  {
    "restaurant_name": "FIG & OLIVE | Fifth Avenue",
    "city": "New York City",
    "place_id": "ChIJZbgM8_tYwokRFnNjm92tco0",
    "review_text": "Dining at Fig & Olive was such a pleasant experience from start to finish.\n\nEvery single item on the menu is crafted to perfection with the highest quality ingredients, intricately added to each dish. Everything is there for a reason and tastes absolutely amazing.\n\nEven the salad was one of the best salads we ever had.\n\nKeep in mind that the food takes some time to prepare, but I guess that’s how you know that everything is being made fresh!\n\nDo not miss Fig & Olive!",
    "review_rating": 5,
    "review_author": "Mario Kazzi",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Havana Central Times Square",
    "city": "New York City",
    "place_id": "ChIJy0KKmVVYwokRyab_FcJzFA0",
    "review_text": "Delicious food, friendly staff, and great prices! Plenty of options for me that were gluten free, dairy free, and soy free. A bit loud for my taste but it was a great experience. Thrilled by the guava smoothie. The staff that greeted us were warm. Luiza, our server, was nice and attentive. The people that came to our table with waters, our orders, and to pick up dishes were so friendly too. And did I mention the delicious food?! Thanks to entire team - from the front end to the kitchen and everyone in between. Definitely recommend! 👏",
    "review_rating": 5,
    "review_author": "Tatiana Rodriguez",
    "moods": [
      "budget",
      "family"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Havana Central Times Square",
    "city": "New York City",
    "place_id": "ChIJy0KKmVVYwokRyab_FcJzFA0",
    "review_text": "Visited Friday night for happy hour. Our wait to get a table was 50 minutes. Instead we went to the bar and were lucky that guest left and we had availability for 2 seats. Our server Israel made our transition smoothly and quick. We order various appetizers and drinks. Beer Pacifico and Blue moon\n.Drinks passion fruit mojito with fresh sugar cane and mint. The band was there tuning their sound for a while but once they got it together they played a set of various song not limited to Cuban music.  Overall it was good atmosphere and food.  I liked the green sauce instead of f the mayo sauce drizzle all over out appetizers. I've been to the LI Havana central which i visited various times and they also ha e live bands and delicious food.",
    "review_rating": 5,
    "review_author": "Jazmin Jurado",
    "moods": [
      "celebration",
      "late_night"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Havana Central Times Square",
    "city": "New York City",
    "place_id": "ChIJy0KKmVVYwokRyab_FcJzFA0",
    "review_text": "The night I went to Havana Central was my first time in New York City and he made my experience even greater. The food was absolutely excellent. I live in California and I've tried a few Cuban places and this one was one of the best. The young man who served me was outstanding super Pleasant and very attentive I forget his name I wish I could remember it all I know is that he is very young thin half Mexican half Salvadorian but he made my experience a Havana Central the more pleasant. I love the atmosphere the decorations the happiness of the people celebrating and even though they were super busy everyone seem to be having a great time. If you ever go to New York City you must try Havana Central.",
    "review_rating": 5,
    "review_author": "George Fernandez",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Havana Central Times Square",
    "city": "New York City",
    "place_id": "ChIJy0KKmVVYwokRyab_FcJzFA0",
    "review_text": "We loved this place! I went with 3 friends and we received a great service by Rafaela. Food was delicious and great size portions, my favorite was the ropa vieja. Will definitely come back!",
    "review_rating": 5,
    "review_author": "Katherine",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.6
  },
  {
    "restaurant_name": "Havana Central Times Square",
    "city": "New York City",
    "place_id": "ChIJy0KKmVVYwokRyab_FcJzFA0",
    "review_text": "The food was scrumptious!! I went for the first time after seeing the broadway play Buena Vista Social Club. We ordered the corn and empanadas for starters…let me just say we cleared the plates. It could have stopped there and I would have been pleased but no it kept getting better. I had steak with the shrimp in butter garlic sauce, my cousin had the snapper. Service was friendly and fast. Drinks were strong and the price was compatible plus totally worth it. Portions were large, I had take home enough for a second meal. Sorry for my pictures in advance lol Listen…I’ll be back",
    "review_rating": 5,
    "review_author": "Ty S",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "fresh&co",
    "city": "New York City",
    "place_id": "ChIJm5XlqK9ZwokRskEZP6W-24c",
    "review_text": "I recently visited this restaurant and was thoroughly impressed. The ambiance is quiet and beautiful, making it a perfect spot for a relaxing meal. The service is exceptional, with attentive and friendly staff who ensure you have everything you need. The display of the dishes is excellent, showcasing the chef’s attention to detail and creativity. The meals themselves are special, with unique flavors and high-quality ingredients that make each bite a delight. It’s definitely worth trying if you’re looking for a memorable dining experience.",
    "review_rating": 5,
    "review_author": "Mussa Zein",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.85
  },
  {
    "restaurant_name": "fresh&co",
    "city": "New York City",
    "place_id": "ChIJm5XlqK9ZwokRskEZP6W-24c",
    "review_text": "This is the place you want to find in a trip. Sometimes it is difficult to find healthy food. This place was simply perfect, hundreds options to lunch time. My sister and me suffer to find places to eat healthy and this place made our day.",
    "review_rating": 5,
    "review_author": "SaRay Mt",
    "moods": [
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "fresh&co",
    "city": "New York City",
    "place_id": "ChIJm5XlqK9ZwokRskEZP6W-24c",
    "review_text": "This is one of the few salads I genuinely enjoy and can eat every day, and it really helps me stay consistent with my intake control, especially when I’m on a lunch break and trying to avoid pizza or other heavy, high-calorie options.\n\nI most often get the Cali Cobb with hot sauce, sometimes with crispy chicken as a treat, and it’s always solid. The manager and staff are very nice and friendly.\n\nTheir breakfast guacamole toast is good too, but I usually stick with the same salad.\n\nFast service and balanced ingredients.",
    "review_rating": 5,
    "review_author": "Wei-Lun Ting",
    "moods": [
      "quick_bite",
      "work"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "fresh&co",
    "city": "New York City",
    "place_id": "ChIJm5XlqK9ZwokRskEZP6W-24c",
    "review_text": "Today, I had the pleasure of visiting Fresh & Co., and it was an amazing experience! 🥞🍳 For breakfast, they offer a variety of incredibly delicious dishes that truly stand out, and their dinner options are just as impressive! 🍴✨ The atmosphere is not only clean and beautifully designed, but the staff is also super friendly and welcoming, making you feel right at home. 😊🌿 If you’re looking for fresh, flavorful meals served with a smile, this is the perfect spot! 💚🍽 Definitely a must-visit for food lovers",
    "review_rating": 4,
    "review_author": "Mehmet Ç (Holamemodios)",
    "moods": [
      "celebration",
      "date",
      "family"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "fresh&co",
    "city": "New York City",
    "place_id": "ChIJm5XlqK9ZwokRskEZP6W-24c",
    "review_text": "The food is amazing it is all fresh and the flavours are amazing, it got us ready for our busy day ahead. My favourite was the power BLT with a tea and a dash of honey with milk and bowl of fruit, Greek yogurt or a smoothy, everything was too good we had to try it all and it didn’t disappoint it was amazing and tasty. We had breakfast there everyday when we visited New York. Everyone is really friendly and we were always welcomed and Everett is amazing he is very welcoming and friendly always welcoming us, made sure we are okay and had great conversations.",
    "review_rating": 5,
    "review_author": "Rebecca Scott",
    "moods": [
      "work",
      "budget",
      "quick_bite"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "STK Steakhouse",
    "city": "New York City",
    "place_id": "ChIJXTDiAwBZwokRHTaHoPYW5oo",
    "review_text": "Went out with my friends the other night for a fun girls night out, I love STK. They have always been very consistent and the atmosphere is fun with an upbeat vibe great music, excellent cocktails.\nI had the filet mignon which was cooked to perfection. The shrimp cocktail was amazing and the shrimps were large. I love their bread with the dipping sauce. Our server Christian was amazing. He made sure we got everything we wanted and explained the menu and drinks very thoroughly. I found parking right out front, which was a plus can’t wait to go back. They even have a cool video Photo Booth at the front for your social media, which was awesome ! Oh and the bag of donuts with the dipping sauce or a must for dessert !!!",
    "review_rating": 5,
    "review_author": "Chrissy Monroe",
    "moods": [
      "celebration",
      "late_night"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "STK Steakhouse",
    "city": "New York City",
    "place_id": "ChIJXTDiAwBZwokRHTaHoPYW5oo",
    "review_text": "My boyfriend and I came here last night for a fancy dancy romantic dinner date just shy of Christmas 🎄 I was looking at steakhouses that had very nice reviews and the STK franchise was a fan favorite. The Midtown location was more convenient to commute to and had reservation availability for Monday evening. Upon entering, it was low lit and purple and there were plenty of people seated and a few waiting to be seated. The indoor decorations were holiday themed and pretty and the music playlist was great; I heard a lot of songs I knew and haven't heard in awhile in a nice remix 🎶 The service was splendid, I believe our waitress was named Corin (I hope I spelled that correctly!). She was very knowledgeable of the menu, very attentive and overall pleasant 🤗 We even met one of the general managers, Edwin, whom was very polite and professional too.\nNow the food! I had the surf n turf with brussel sprouts and my boyfriend had the Australian flat iron wagyu steak with mac and cheese. As for the drink, I had the Dragon cocktail, it was very sweet, right up my alley 🍸 And the appetizers consisted of the lil bite burgers and the wagyu pot stickers. Everything was splendid, from the presentation, to the flavors and the portions. Of course nothing runs cheap here, but there are some nice menus for the holidays and the $69 per person fixed menu. There's also other options like Steak Night and such. I 100% recommend this place; the lobster tail and steak had me in a chokehold...and that lobster butter?? 😋🤤 take me back 🙏🏾 But yes! We look forward to going again in the future! ✨",
    "review_rating": 5,
    "review_author": "Quinaya Smith",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "STK Steakhouse",
    "city": "New York City",
    "place_id": "ChIJXTDiAwBZwokRHTaHoPYW5oo",
    "review_text": "This was my first time at this wonderful establishment. Arrived with no reservations on a Friday night with my best friend and we were seated within 5 min in a very quaint area. (NYASIA) was our server and she was extremely professional, knowledgeable and pleasant! Her recommendations were ALL ON POINT!! She checked on us just enough but not overly. The delicious good arrived fast, hot and well seasoned.\n\nIt was a great experience for me and my bestie said she has never been disappointed with any of her visits there!\n\nThank you for an AMAZING CULINARY EXPERIENCE 💙‼️💯",
    "review_rating": 5,
    "review_author": "Mico Renee",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "STK Steakhouse",
    "city": "New York City",
    "place_id": "ChIJXTDiAwBZwokRHTaHoPYW5oo",
    "review_text": "On November 14, 2025, at approximately 10:30 PM, I visited this location. The food was decent, especially considering the $200 price point. The atmosphere was lovely and cozy. However, the service was lacking. I had to ask multiple times just to receive water. After my meal, I ordered dessert to go and waited over 20 minutes for it. When I notified the assistant manager, he agreed to remove the dessert from my bill—but that never happened. Due to this experience, I will not be returning to this location.",
    "review_rating": 5,
    "review_author": "Andre Scarborough",
    "moods": [
      "celebration",
      "late_night"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "STK Steakhouse",
    "city": "New York City",
    "place_id": "ChIJXTDiAwBZwokRHTaHoPYW5oo",
    "review_text": "STK Steakhouse Midtown (1114 6th Ave, New York, NY 10036) has one of the best brunch deals I’ve experienced. Their all-you-can-eat brunch for $39 per person is truly impressive, especially for Midtown. The space is beautiful and fully decorated for the holidays, making it perfect for a girls brunch or a date spot.\n\nWe tried one of everything, and the Chicken & Waffles were the standout perfectly crisp, tender, and full of flavor.\n\nAll You Can Eat STK Brunch Includes:\n•\tBread Basket: Croissant, cinnamon roll, mini baguettes\n•\tBaby Gem Caesar: Parmigiano Reggiano, lemon black pepper emulsion, herb crouton\n•\tCheese & Charcuterie: Cheddar, Manchego, prosciutto, salami, watermelon and berries\n•\tMains: Chicken & Waffles, biscuits and gravy, cheesy tots, scrambled eggs, bacon and sausage\n•\tBeverage: Coffee or orange juice\n\nEverything was delicious, the service was great, and the holiday atmosphere made the experience even better. Highly recommend.",
    "review_rating": 5,
    "review_author": "Lauren S",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.85
  },
  {
    "restaurant_name": "Scarpetta",
    "city": "New York City",
    "place_id": "ChIJt8W7n79ZwokRsyXs3QDbE3o",
    "review_text": "The spaghetti was indeed legendary- Perfect- Al dente- sauce was both mild and hearty. It might be simple but it stood out.\nPeach Bellini was a beautiful + light dessert\nWe enjoyed the broccolini a lot.\nWe also tried the yellowtail, halibut, ravioli, and braised short rib. These were all good! But the above was exceptional.",
    "review_rating": 5,
    "review_author": "Anna Chang",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Scarpetta",
    "city": "New York City",
    "place_id": "ChIJt8W7n79ZwokRsyXs3QDbE3o",
    "review_text": "Delicious pastas, key lime cheesecake was just balance and light. Only reason I gave 4 stars is because of the super rude sommelier. Our waitress suggested us to bring the sommelier to recommend a bottle of wine. Sommelier came by to our table looking very unhappy, rushing us to decide, didn’t even ask anything about what type of wine we want to drink or suggest! Only thing he said I’ll let you talk and decide, I’ll come back when you know!  We just decided to get a bottle of Barolo, he just said it’s a good choice then opened it for us and pour the wine in our glasses. He miss and poured some in my appetizer plate and didn’t even bother to apologize or change my plate! In the other hand the manager and our server this evening were very accommodating and helpful!",
    "review_rating": 4,
    "review_author": "Justine Mogren",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Scarpetta",
    "city": "New York City",
    "place_id": "ChIJt8W7n79ZwokRsyXs3QDbE3o",
    "review_text": "This place blew it away! The food was incredible. Delicious! from Appetizer to dessert. Highly recommend the seared scallops. Definitely A must try when you’re in NYC.",
    "review_rating": 5,
    "review_author": "Eliud Rangel",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Scarpetta",
    "city": "New York City",
    "place_id": "ChIJt8W7n79ZwokRsyXs3QDbE3o",
    "review_text": "Overall, a great dining experience with one notable service caveat. My family was visiting, and we went on a Tuesday evening at 8:00 PM. Once seated, the service was excellent—but the maître d’ experience and table timing were the main drawback.\n\nWe were unable to get a clear estimate on when our table would be ready and were asked to wait in the bar area. We ended up waiting about 45 minutes, ordering drinks at the bar that were charged separately from the table. We were finally seated around 8:45 PM, at which point Scarpetta did a nice job making it right with complimentary drinks and hors d’oeuvres. By the time we finished dinner, the restaurant was about half empty, which added to the frustration of the earlier wait.\n\nFood-wise, everything delivered. I had the agnolotti, while others ordered the sirloin, pumpkin gnocchi, and tagliolini nero—all excellent. Desserts were also delicious, and our server was fantastic, attentive, and polished throughout the meal.\n\nBottom line: the food is great and well worth visiting, but better front-of-house timing communication would go a long way. We were close to leaving for another restaurant due to the uncertainty. That said, I’d absolutely return and would expect a smoother seating experience next time.",
    "review_rating": 4,
    "review_author": "Ben",
    "moods": [
      "celebration",
      "family"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Scarpetta",
    "city": "New York City",
    "place_id": "ChIJt8W7n79ZwokRsyXs3QDbE3o",
    "review_text": "When I tell you… amazing service… amazing atmosphere and amazing food… Scarpetta lives up the hype. I took my dad here for his birthday, and he loved it as well….. I highly recommend a visit here.",
    "review_rating": 5,
    "review_author": "Dorcas Johnson",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Central Park Boathouse",
    "city": "New York City",
    "place_id": "ChIJm17AB5pYwokRWLJ6lEtXKOA",
    "review_text": "Beautiful location, with excellent service, and yummy food.\n\nThe only issue I had is their prices which is why I only gave them 4 stars.  Come on now, $6 for a small cup of coffee, can't remember how much for a bottle of sparkling water, and, I think, they charged $15-$17 for a little bit of Kahlua!  The lunch food prices were more reasonable though.\n\nOverall, tasty food, prime location, and great service!  The Boathouse was also very accommodating with us, providing us a table without a reservation! :)\n\nWould I go again? Yes!  But I'd definitely skip the drinks next time because those drinks doubled our bill.",
    "review_rating": 4,
    "review_author": "JP T",
    "moods": [
      "work",
      "date",
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Central Park Boathouse",
    "city": "New York City",
    "place_id": "ChIJm17AB5pYwokRWLJ6lEtXKOA",
    "review_text": "We had such a wonderful experience at the Central Park Boathouse on Friday, September 26! Our waiter, Jim, was extremely friendly and warm, which made the evening even more special. We ordered pasta and wine, and with the perfect weather, the windows were open so we could enjoy the fresh air and a stunning view over the lake toward Bethesda Fountain. The entire setting felt magical, like something out of a movie, showing off why New York City is such an amazing place.\n\nThe walk to and from the restaurant was just as enjoyable—peaceful and relaxing through the park, with the bonus of stumbling upon a lively group salsa dancing event on the way home. We couldn’t resist joining in for a bit, which was the perfect ending to an already memorable night.\n\nHighly recommend for anyone looking for a beautiful and unique New York City dining experience right inside the best park in the world!",
    "review_rating": 5,
    "review_author": "Ross Iskowitz",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Central Park Boathouse",
    "city": "New York City",
    "place_id": "ChIJm17AB5pYwokRWLJ6lEtXKOA",
    "review_text": "The staff members are very friendly and professional… every customer walking out very happy … the clam chowders soup Sooooooo yummy … first bite has already touched my heart! I me as the no snap no eat person just remember to take a picture when I almost done with the clam chowder soup …the linguini is highlighted with huge fresh shrimps and seasoned to perfection… Marc the manager very patient to address my concerns…",
    "review_rating": 5,
    "review_author": "Peace Love",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Central Park Boathouse",
    "city": "New York City",
    "place_id": "ChIJm17AB5pYwokRWLJ6lEtXKOA",
    "review_text": "The Boathouse offered us a very pleasant dining experience. We ordered several pasta dishes and a selection of desserts; the pasta was clearly fresh and made daily, and the desserts were homemade and well executed. The food was good and enjoyable, even if not especially outstanding.\n\nThe setting is beautiful and adds a lot to the overall experience, and the service was excellent throughout the meal. The Flowers wine recommended by our waiter was a great choice. Overall, a place we would return to without hesitation.",
    "review_rating": 4,
    "review_author": "Javier Novella Peris",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Ruth's Chris Steak House",
    "city": "Boston",
    "place_id": "ChIJa04qjoRw44kR2r2tfLdX2fg",
    "review_text": "Came here for a Bachelor Party dinner. Excellent food. Quality service. Diego made some excellent recommendations. The 3 For option is very reasonable and comes with a starter, entre, and dessert. Definitely would recommend for a date night, business meeting, or any type of celebratory dinner. Someone came for their birthday and the staff took care of them as well without obnoxious loud singing.",
    "review_rating": 5,
    "review_author": "Christopher Scott",
    "moods": [
      "celebration",
      "date",
      "work"
    ],
    "mood_confidence": 0.9
  },
  {
    "restaurant_name": "Back Bay Social",
    "city": "Boston",
    "place_id": "ChIJ2X25uw9644kRGG8gByNprGU",
    "review_text": "Right across the street from the mall. After 10pm they have live music in the basement where the bathrooms are as well. We went in. Friday night, mostly younger crowd and wait staff was very friendly.",
    "review_rating": 4,
    "review_author": "lifeaskarina",
    "moods": [
      "late_night",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "P.F. Chang's",
    "city": "Boston",
    "place_id": "ChIJb8BV9XZ644kRk542Fx092xg",
    "review_text": "Cole was an amazing server who was attentive and helpful with recommendations. The food was good and the atmosphere was mellow. Definitely will be going back. Thank you Cole!",
    "review_rating": 5,
    "review_author": "Chris'Val Guerrier",
    "moods": [
      "work",
      "date"
    ],
    "mood_confidence": 0.6
  },
  {
    "restaurant_name": "Tropisueno",
    "city": "San Francisco",
    "place_id": "ChIJfcaly4eAhYARSIvvfFpH64w",
    "review_text": "This is amazing restaurant with some great drinks and food! The taqueria fight is my favorite.\nAny taco or Mexican dish is great ~ I had beef cheek taco and it melts in my mouth.\nhighly recommended.",
    "review_rating": 5,
    "review_author": "Yusi",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "ROOFTOP 25",
    "city": "San Francisco",
    "place_id": "ChIJAzkmQNZ_j4ARs6PNLtDYE_g",
    "review_text": "We went there for a quick drink and a small bite. The focaccia was so good and the sauce was really yummy!!",
    "review_rating": 4,
    "review_author": "francin gallegoszarate",
    "moods": [
      "quick_bite"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "The Harlequin",
    "city": "San Francisco",
    "place_id": "ChIJRcqFN4aAhYARSvdFY6nNytM",
    "review_text": "Such an amazing experience. The venue is designed extremely well. The food is incredible and the wait staff are very fast and very friendly!  The smash burger is life changing. Save room for cheesecake!",
    "review_rating": 5,
    "review_author": "Mike York",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Bottega Louie",
    "city": "Los Angeles",
    "place_id": "ChIJ_yXhTrTHwoARU36hVDFInhg",
    "review_text": "Recommendation for macaron : earl grey, mint, chocolate🫶 the texture is incredibly perfect and soft but still crunchy. The flavour is subtle but still flavorful. Love this. The atmosphere and packaging is giving luxurious and elegant. I have fun in very stage of enjoying this",
    "review_rating": 5,
    "review_author": "mmi",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Cicada Restaurant and Lounge",
    "city": "Los Angeles",
    "place_id": "ChIJ4S8a47THwoARo-6PnNsOvcU",
    "review_text": "One certainly can feel being transported into speakeasy times of the 20th century. Great ambiance, food, and entertainment. Looking forward to many returns.",
    "review_rating": 5,
    "review_author": "Oleg Dymovsky",
    "moods": [
      "date",
      "celebration"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Mexicali Taco & Co.",
    "city": "Los Angeles",
    "place_id": "ChIJG33qlVbGwoARofX6oBQ2WyE",
    "review_text": "I absolutely loved the fish and chicken tacos! 10/10! The portions were generous and the fresh juices were a bonus. I enjoyed the flavors and would happily eat here again.",
    "review_rating": 5,
    "review_author": "Rachel Davidson",
    "moods": [
      "quick_bite",
      "budget"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Buca di Beppo Italian Restaurant",
    "city": "Seattle",
    "place_id": "ChIJqcEWDzkVkFQRApc1W87ZbEE",
    "review_text": "What an amazing restaurant!! Had a great dinner for 2 with Fluffy as our server! The pear and prosecco spritz was my favorite!! We had lots of left overs,  so come with the family!!",
    "review_rating": 5,
    "review_author": "Jen Estep",
    "moods": [
      "date",
      "family"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Daniel's Broiler",
    "city": "Seattle",
    "place_id": "ChIJ_68tTToVkFQR-MqoONjRaUA",
    "review_text": "Delicious food and a delightful way to spend the evening. Went with a couple friends, we sat on the bar side and ordered multiple sides: the Brussels sprouts, lobster mashed potatoes, and mushrooms which were to die for. The bartender makes a fantastic martini! 🍸",
    "review_rating": 5,
    "review_author": "Daisy",
    "moods": [
      "celebration",
      "date"
    ],
    "mood_confidence": 0.8
  },
  {
    "restaurant_name": "Dimitriou's Jazz Alley",
    "city": "Seattle",
    "place_id": "ChIJa2POnksVkFQRCRo3bna-3Gc",
    "review_text": "Great music in an iconic setting that never disappoints. High energy performances provide an excellent opportunity to explore the wide range of both jazz forms and talent in a comfortable and welcoming venue.",
    "review_rating": 5,
    "review_author": "Cinderella",
    "moods": [
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "McMenamins Six Arms",
    "city": "Seattle",
    "place_id": "ChIJ2Rza3cpqkFQRZdmDkG51JUc",
    "review_text": "The best burger and Tots so far !!!!\nChowder was so good !!!\nHoliday Drinks the  bomb!!\nDefinitely my top place for food.",
    "review_rating": 5,
    "review_author": "Susan",
    "moods": [
      "quick_bite",
      "celebration"
    ],
    "mood_confidence": 0.7
  },
  {
    "restaurant_name": "Tavolàta Belltown",
    "city": "Seattle",
    "place_id": "ChIJzSyY000VkFQR9bWQhF5ItrE",
    "review_text": "Bruschetta Burrata is WILD made with great care and fresh ingredients, so good we got two orders. Cesar had fresh lettuce and dressed well. Happy hour is of good value too! The dude running the food was super friendly and waitress was chill too",
    "review_rating": 5,
    "review_author": "Nesto",
    "moods": [
      "celebration",
      "budget"
    ],
    "mood_confidence": 0.8
  }
]